Repository: ornfelt/stk-code
Catalog: data/po/*.po
Languages: cy

source: When input devices are configured, select the 'Splitscreen Multiplayer' icon in the main menu. Each player can press the 'fire' key of their gamepad or keyboard to join the game, and use their input device to select their kart. The game continues when everyone selected their kart. Note that the mouse may not be used for this operation.
cy: Pan fydd dyfeisiau mewnbwn wedi'u ffurfweddu, dewisa'r eicon 'Sgrin Hollt Aml-chwaraewr' yn y brif ddewislen. Gall pob chwaraewr bwyso bysell 'fire' eu pad gêm neu fysellfwrdd i ymuno â'r gêm, a defnyddio eu dyfais fewnbynnu i ddewis eu cart. Mae'r gêm yn parhau ar ôl i bawb ddewis eu cart. Nid oes modd defnyddio llygoden i wneud hyn.

source: High Score Selection
cy: Dewisiadau Sgôr Uchel

source: Lap Trial
cy: Treialon Lapio

source: Choose a Kart
cy: Dewis Cart

source: Kart Class
cy: Dosbarth Cart

source: Edit favorite karts
cy: Golygu hoff gartiau

source: Singleplayer
cy: Chwaraewr unigol

source: Splitscreen Multiplayer
cy: Sgrin Hollt Aml-chwaraewr

source: Online
cy: Ar-lein

source: Addons
cy: Ychwanegion

source: Tutorial
cy: Tiwtorial

source: High Scores
cy: Sgoriau Uchel

source: Achievements
cy: Llwyddiannau

source: Grand Prix Editor
cy: Golygydd Grand Prix

source: About
cy: Ynghylch

source: Server Creation
cy: Creu Gweinydd

source: Name of the server
cy: Enw'r gweinydd

source: Max. number of players
cy: Uchafwsm nifer o chwaraewyr

source: Password for private server (optional)
cy: Cyfrinair ar gyfer gweinydd preifat (dewisol)

source: Create
cy: Creu

source: Local Networking
cy: Rhwydweithio Lleol

source: Find Server
cy: Canfod Gweinydd

source: Create Server
cy: Creu Gweinydd

source: Lobby
cy: Cyntedd

source: Configuration
cy: Ffurfweddiad

source: Start race
cy: Cychwyn y ras

source: Enable splitscreen or player handicaps
cy: Galluogi anfanteision sgrin hollt neu chwaraewr

source: Local networking
cy: Rhwydweithio lleol

source: Global networking
cy: Rhwydweithio byd-eang

source: Enter server address
cy: Rhoi cyfeiriad y gweinydd

source: Your profile
cy: Dy broffil

source: Player rankings
cy: Safle chwaraewyr

source: Friends
cy: Ffrindiau

source: Look for more friends:
cy: Chwilio am ragor o ffrindiau:

source: Search
cy: Chwilio

source: Global Networking
cy: Rhwydweithio Byd-eang

source: Quick Play
cy: Chwarae Cyflym

source: Account Settings
cy: Gosodiadau Cyfrif

source: Password:
cy: Cyfrinair:

source: Change
cy: Newid

source: E-mail:
cy: E-bost:

source: Create User
cy: Creu Defnyddiwr

source: New Online Account
cy: Cyfrif Ar-lein Newydd

source: Existing Online Account
cy: Cyfrif Ar-lein Cyfredol

source: Offline Account
cy: Cyfrif All-lein

source: Local Name
cy: Enw Lleol

source: Online Username
cy: Enw Defnyddiwr Ar-lein

source: Reset password
cy: Ailosod cyfrinair

source: You can play without creating an online account by selecting an offline account. Though then you can not connect to friends, vote for addons etc. Please read our privacy statement at https://privacy.supertuxkart.net
cy: Mae modd i ti chwarae heb greu cyfrif ar-lein trwy ddewis cyfrif all-lein. Er hynny nid oes modd i ti gysylltu â ffrindiau, pleidleisio dros ategion ac ati. Darllena ein datganiad preifatrwydd yn https://privacy.supertuxkart.net

source: Server Selection
cy: Dewis Gweinydd

source: Show private server(s)
cy: Dangos gweinydd(ion) preifat

source: Use IPv6 connection
cy: Defnyddio cysylltiad IPv6

source: User search
cy: Chwilio defnyddiwr

source: SuperTuxKart Options
cy: Dewisiadau SuperTuxKart

source: Display
cy: Dangos

source: Graphics
cy: Graffigau

source: Audio
cy: Sain

source: Interface
cy: Rhyngwyneb

source: Players
cy: Chwaraewyr

source: Controls
cy: Rheolyddion

source: Language
cy: Iaith

source: Music
cy: Cerddoriaeth

source: Enabled
cy: Galluogwyd

source: Volume
cy: Lefel Sain

source: Sound Effects
cy: Effeithiau Sain

source: Delete Configuration
cy: Dileu Ffurfweddiad

source: Disable Configuration
cy: Analluogi Ffurfweddu

source: Back to device list
cy: Nôl i'r rhestr dyfeisiau

source: Rename Configuration
cy: Ailenwi Ffurfweddiad

source: Enable force feedback (if supported)
cy: Galluogi adborth grym (os caiff ei gefnogi)

source: Resolution
cy: Cydraniad

source: Fullscreen
cy: Sgrin Lawn

source: Remember window location
cy: Cofio lleoliad ffenestr

source: Apply new resolution
cy: Gosod cydraniad newydd

source: Splitscreen Multiplayer layout
cy: Cynllun Sgrin Hollt Aml-chwaraewr

source: Internet options
cy: Dewisiadau rhyngrwyd

source: Always show login screen
cy: Dangos y sgrin mewngofnodi bob tro

source: Connect to the Internet
cy: Cysylltu â'r Rhyngrwyd

source: Enable chatting in online lobbies
cy: Galluogi sgwrsio mewn lobïau ar-lein

source: Enable chatting in online matches
cy: Galluogi sgwrsio mewn gemau ar-lein

source: Miscellaneous options
cy: Dewisiadau amrywiol

source: Enable per-player handicaps
cy: Galluogi anfanteision fesul chwaraewr

source: Uninstall full game assets
cy: Dadosod asedau gêm llawn

source: Press enter or double-click on a device to configure it
cy: Pwysa Enter neu clicio ddwywaith ar ddyfais i'w ffurfweddu

source: Add a device
cy: Ychwanegu dyfais

source: * Which config to use will be inferred from which 'Select' key is pressed to join the game.
cy: * Bydd pa ffurfweddiad i'w ddefnyddio yn cael ei gasglu o ba fysell 'Dewis' sy'n cael ei bwyso i ymuno â'r gêm.

source: Skin
cy: Croen

source: Skin variant
cy: Amrywiad croen

source: Minimap
cy: Map Bychan

source: Font size
cy: Maint ffont

source: Custom...
cy: Cyfaddasu...

source: Display FPS
cy: Dangos FPS

source: Show other karts' held powerups
cy: Dangos pweriadau cartiau eraill

source: Enable the story mode timer
cy: Galluogi'r amserydd modd stori

source: Enable the speedrun timer
cy: Galluogi'r amserydd rhediad cyflym

source: Render resolution
cy: Cydraniad rendro

source: Graphical Effects Level
cy: Lefel Effeithiau Graffigol

source: Blur Effects Level
cy: Lefel Effeithiau Pwl

source: Maximum FPS
cy: Uchafswm FPS

source: Custom settings...
cy: Gosodiadau cyfaddas...

source: Performance tests
cy: Profion perfformiad

source: Performance test of the current settings
cy: Prawf perfformiad o'r gosodiadau cyfredol

source: Remember password
cy: Cofio cyfrinair

source: Delete
cy: Dileu

source: Kart color
cy: Lliw cart

source: Select a difficulty
cy: Dewis anhawster

source: Select a game mode
cy: Dewis pa fodd gêm

source: Use left/right to choose your team and press fire
cy: Defnyddio chwith/dde i ddewis dy dîm a phwyso'r botwm tanio

source: Red Team
cy: Tîm Coch

source: Blue Team
cy: Tîm Glas

source: Number of laps
cy: Nifer o lapiau

source: Number of AI karts
cy: Nifer y cartiau AI

source: Number of blue team AI karts
cy: Nifer y cartiau AI tîm glas

source: Random Grand Prix
cy: Grand Prix ar hap

source: Edit favorite tracks
cy: Golygu hoff draciau

source: Login
cy: Mewngofnodi

source: The UI skin can be changed in the UI options.
cy: Mae modd newid croen y rhyngwyneb yn Newisiadau'r rhyngwyneb.

source: You can see other karts' powerups by enabling it in the UI options.
cy: Mae modd gweld pweriadau cartiau eraill trwy ei alluogi yn Newidiadau'r Rhyngwyneb.

source: The font size can be changed in the UI options.
cy: Mae modd newid maint y ffont yn Newidiadau'r Rhyngwyneb.

source: The help menu has lots of useful information.
cy: Mae llawer o wybodaeth ddefnyddiol yn y ddewislen Cymorth.

source: In single-player, you can watch and challenge recorded time-trials.
cy: Fel chwaraewr unigol, mae modd gwylio a herio profion amser wedi'u recordio.

source: You can visit https://supertuxkart.net/ for more information about the game.
cy: Mae ragor o wybodaeth am y gêm yn https://supertuxkart.net/.

source: Short nitro boosts are more efficient.
cy: Mae hybiau nitro byr yn fwy effeithlon.

source: Only use zippers when it is safe. Long straight lines are ideal.
cy: Defnyddia Sipiau dim ond pan fydd yn ddiogel. Traciau hir a syth sydd orau.

source: Don't use multiple zippers quickly in row, instead, wait until the speed boost wears off.
cy: Paid â defnyddio sipiau lluosog yn gyflym un ar ôl y llall, arhosa nes bod yr hwb cyflymder yn pylu.

source: Skidding makes you much faster, do it whenever safe.
cy: Mae sgidio yn dy wneud yn llawer cyflymach, gwna hynny pryd bynnag mae'n ddiogel.

source: The swatter can be used to remove bombs or parachutes.
cy: Mae modd defnyddio'r swatiwr i ddileu bomiau neu barasiwtiau.

source: You can't stop turning while skidding. Good kart orientation at the skid's start is paramount.
cy: Nid oes modd peidio â throi wrth sgidio. Mae gosod cyfeiriad y cart ar gychwyn y sgid yn hollbwysig.

source: You get a startup boost if you start accelerating during "Set".
cy: Byddi'n cael hwb cychwyn os byddi'n cychwyn cyflymu yn ystod "Set".

source: Braking allows to get rid of parachutes quicker.
cy: Mae brecio'n caniatáu i ti gael gwared ar barasiwtiau yn gyflymach.

source: First and foremost, focus on where your kart is going.
cy: Yn gyntaf oll, canolbwyntia ar ble mae'ch cart yn mynd.

source: The rescue key (button) is very useful.
cy: Mae'r allwedd achub (botwm) yn ddefnyddiol iawn.

source: Be careful when close to other karts, they may attack you!
cy: Bydd yn ofalus pan fyddi'n agos at gartiau eraill, efallai y byddan nhw'n ymosod arnat ti!

source: Basketballs can be destroyed using precise backward shots with a bowling ball, cake, or plunger.
cy: Mae modd dinistrio peli-fasged gan ddefnyddio ergydion manwl tuag yn ôl gyda phêl fowlio, cacen, neu blymiwr.

source: Try to avoid crashing into the backs of other karts as this will slow you down.
cy: Ceisia osgoi taro i mewn i gefn cartiau eraill gan y bydd hyn yn dy arafu.

source: You can use bowling balls to push and block the ball.
cy: Gelli ddefnyddio peli bowlio i wthio a rhwystro'r bêl.

source: In soccer, always work as a team for good results.
cy: Mewn pêl-droed, gweithiwch fel tîm bob amser i gael canlyniadau da.

source: If you miss the ball and an opponent is approaching, try hitting them with a powerup or block their way.
cy: Os byddi'n colli'r bêl a bod gwrthwynebydd yn agosáu, ceisia eu taro â phweriad neu rwystro'u ffordd.

source: Good rotation of positions (attack and defense) is essential.
cy: Mae symud safleoedd effeithiol (ymosod ac amddiffyn) yn hanfodol.

source: Make sure to store at least 2 big cans worth of nitro.
cy: Gwna'n siŵr dy fod yn storio o leiaf 2 gan fawr o nitro.

source: Never use the three bowling balls all at the same time.
cy: Peidia byth â defnyddio'r tair pêl bowlio i gyd ar yr un pryd.

source: Don't get in the way of a teammate carrying the ball, though you can try to hit opponents attempting to stop them from scoring.
cy: Paid â rhwystro cyd-chwaraewr rhag cario'r bêl, er y gelli geisio taro gwrthwynebwyr sy'n ceisio ei atal rhag sgorio.

source: Pepper
cy: Pupur

source: Antediluvian Abyss
cy: Bwlch y Cynfyd

source: Alien Signal
cy: Arwydd Estron

source: Ancient Colosseum Labyrinth
cy: Hen Ddrysle'r Colosseum

source: Candela City
cy: Dinas Candela

source: Battle Island
cy: Ynys y Frwydr

source: Black Forest
cy: Coedwig Ddu

source: Cave X
cy: Ogof X

source: Cocoa Temple
cy: Teml Coco

source: Cornfield Crossing
cy: Croesfan Maes Grawn

source: Fort Magma
cy: Caer Magma

source: Gran Paradiso Island
cy: Ynys Gran Paradiso

source: Hole Drop
cy: Pant Twll

source: Icy Soccer Field
cy: Maes Pêl-droed Oer

source: What's wrong, little hippies? Your great gnu leader is missing?
cy: Beth sy'n bod, hipis bach? Mae'ch arweinydd gnu gwych ar goll?

source: Oh yes, see, he's in my castle now and will be served for supper...
cy: O ie, edrychwch, mae yn fy nghastell i nawr a bydd yn cael ei weini fel swper...

source: But I'm a fair creature, so I'll make you a deal.
cy: Ond rwy'n creadur teg, felly fe wna i fargen â chi.

source: If you can beat me at racing, I will free the old codger.
cy: Os gallwch chi fy nghuro wrth rasio, mi wna i ryddhau'r hen ddyn.

source: But you pathetic little twerps will never be able to beat me - King of the Karts!
cy: Ond fydd dim modd i drueiniaid bach anobeithiol fel chi fy nghuro i - Brenin y Cartiau!

source: Las Dunas Arena
cy: Arena Las Dunas

source: Las Dunas Soccer Stadium
cy: Stadiwm Pêl-droed Las Dunas

source: Around the Lighthouse
cy: O Amgylch y Goleudy

source: Old Mine
cy: Hen Fwynglawdd

source: Minigolf
cy: Minigolff

source: Oliver's Math Class
cy: Dosbarth Mathemateg Oliver

source: Pumpkin Park
cy: Parc Pwmpen

source: Ravenbridge Mansion
cy: Plasty Ravenbridge

source: Shifting Sands
cy: Twyni Symudol

source: Nessie's Pond
cy: Pwll Nessie

source: Northern Resort
cy: Gwyliau'r Gogledd

source: Snow Peak
cy: Copa Eira

source: Soccer Field
cy: Maes Pêl-droed

source: The Stadium
cy: Y Stadiwm

source: STK Enterprise
cy: Menter STK

source: Temple
cy: Teml

source: Volcan Island
cy: Ynys Volcan

source: Zen Garden
cy: Gardd Zen

source: Completed achievement "%s".
cy: Cwblhawyd cyflawniad "%s".

source: Failed to connect to the SuperTuxKart add-ons server.
cy: Wedi methu â chysylltu â gweinydd ychwanegion SuperTuxKart.

source: Error downloading news: '%s'.
cy: Gwall wrth lwytho newyddion: '%s'.

source: Normal Race (Grand Prix)
cy: Ras Arferol (Grand Prix)

source: Time-Trial (Grand Prix)
cy: Treialon Amser (Grand Prix)

source: Time-Trial - beat the replay
cy: Treialon Amser - curo'r ailchwarae

source: Time-Trial - nitro challenge
cy: Treialon Amser - her nitro

source: Normal Race (single race)
cy: Ras Arferol (ras unigol)

source: Time-Trial (single race)
cy: Treialon Amser (ras unigol)

source: Follow the Leader (single race)
cy: Dilyn yr Arweinydd (ras unigol)

source: Mode: Reverse
cy: Modd: Am yn Ôl

source: New track '%s' now available
cy: Mae trac newydd '%s' ar gael nawr

source: New game mode '%s' now available
cy: Mae modd gêm newydd '%s' ar gael nawr

source: New Grand Prix '%s' now available
cy: Mae Grand Prix '%s' newydd ar gael nawr

source: New difficulty '%s' now available
cy: Mae anhawster newydd '%s' ar gael nawr

source: New kart '%s' now available
cy: Mae cart newydd '%s' ar gael nawr

source: Speedrun mode disabled. It can only be enabled if the game has not been closed since the launch of the story mode. Closing the game before the story mode's completion invalidates the timer. To use the speedrun mode, please use a new profile.
cy: Mae Rhediad Cyflym wedi'i analluogi. Dim ond os nad yw'r gêm wedi cau ers lansio'r modd stori y mae modd ei alluogi. Mae cau'r gêm cyn cwblhau'r modd stori yn annilysu'r amserydd. I ddefnyddio'r modd Rhediad Cyflym, defnyddia broffil newydd.

source: Guest
cy: Gwestai

source: Guest %d
cy: Gwestai %d

source: Your config file was malformed, so it was deleted and a new one will be created.
cy: Roedd dy ffeil ffurfweddu wedi'i chamffurfio, felly cafodd ei dileu a bydd un newydd yn cael ei chreu.

source: Your config file was too old, so it was deleted and a new one will be created.
cy: Roedd dy ffeil ffurfweddu'n rhy hen, felly cafodd ei dileu a bydd un newydd yn cael ei chreu.

source: Video recording started.
cy: Dechreuwyd recordio'r fideo.

source: Video saved in "%s".
cy: Fideo wedi'i gadw yn "%s".

source: Encoding progress:
cy: Cynnydd amgodio:

source: Tip: %s
cy: Awgrym: %s

source: Loading
cy: Wrthi'n llwytho

source: Mass
cy: Màs

source: Maximum speed
cy: Cyflymder eithaf

source: Acceleration
cy: Cyflymiad

source: Nitro efficiency
cy: Effeithlonrwydd nitro

source: %s (handicapped)
cy: %s (anfantais)

source: %s is ready
cy: Mae %s yn barod

source: [none]
cy: [dim]

# input_key
source: Left Mouse Button
cy: Botwm Chwith y Llygoden

# input_key
source: Right Mouse Button
cy: Botwm De Llygoden

# input_key
source: Cancel
cy: Na

# input_key
source: Middle Mouse Button
cy: Botwm Canol Llygoden

# input_key
source: X1 Mouse Button
cy: Botwm Llygoden X1

# input_key
source: X2 Mouse Button
cy: Botwm Llygoden X2

# input_key
source: Backspace
cy: Bysell Nôl

# input_key
source: Clear
cy: Clirio

# input_key
source: Pause
cy: Oedi

# input_key
source: Caps Lock
cy: Clo Nodau Mawr

# input_key
source: Final
cy: Terfynol

# input_key
source: Escape
cy: Dianc

# input_key
source: Convert
cy: Trosi

# input_key
source: Nonconvert
cy: Di-drosi

# input_key
source: Accept
cy: Derbyn

# input_key
source: Modechange
cy: Newid modd

# input_key
source: Space
cy: Bwlch

# input_key
source: Left
cy: Chwith

# input_key
source: Up
cy: I fyny

# input_key
source: Right
cy: De

# input_key
source: Down
cy: I lawr

# input_key
source: Select
cy: Dewis

# input_key
source: Print
cy: Argraffu

# input_key
source: Exec
cy: Gweithredwr

# input_key
source: Help
cy: Cymorth

# input_key
source: Left Logo
cy: Logo Chwith

# input_key
source: Right Logo
cy: Logo iawn

# input_key
source: Apps
cy: Apiau

# input_key
source: Sleep
cy: Cysgu

# input_key
source: Numpad 0
cy: Rhif pad 0

# input_key
source: Numpad 1
cy: Rhif pad 1

# input_key
source: Numpad 2
cy: Rhif pad 2

# input_key
source: Numpad 3
cy: Rhif pad 3

# input_key
source: Numpad 4
cy: Rhif pad 4

# input_key
source: Numpad 5
cy: Rhif pad 5

# input_key
source: Numpad 6
cy: Rhif pad 6

# input_key
source: Numpad 7
cy: Rhif pad 7

# input_key
source: Numpad 8
cy: Rhif pad 8

# input_key
source: Numpad 9
cy: Rhif pad 9

# input_key
source: Separator
cy: Ymwahanydd

# input_key
source: - (Subtract)
cy: - (Tynnu)

# input_key
source: Decimal
cy: Degol

# input_key
source: / (Divide)
cy: / (Rhannu)

# input_key
source: Num Lock
cy: Bysell 'Num Lock'

# input_key
source: Scroll Lock
cy: Clo Sgrolio

# input_key
source: Left Shift
cy: Shift Chwith

# input_key
source: Right Shift
cy: Shift De

# input_key
source: Left Control
cy: Control Chwith

# input_key
source: Right Control
cy: Control De

# input_key
source: Left Menu
cy: Dewislen Chwith

# input_key
source: Right Menu
cy: Dewislen De

# input_key
source: Crsel
cy: Cresel

# input_key
source: Play
cy: Chwarae

# input_key
source: Zoom
cy: Chwyddo

# input_key
source: Oem Clear
cy: Oem Clir

source: Gamepad hat %d
cy: Het gamepad %d

source: Axis %d %s
cy: Echel %d %s

source: Axis %d inverted
cy: Echel %d wedi'i gwrthdroi

source: Axis %d
cy: Echel %d

source: Gamepad button %d
cy: Botwm pad gêm %d

source: Mouse button %d
cy: Botwm llygoden %d

source: Mouse axis %d %s
cy: Echel llygoden %d %s

source: Please re-configure your key bindings.
cy: Ail-ffurfwedda dy ddynodiad bysell.

source: Your input config file is not compatible with this version of STK.
cy: Nid yw eich ffeil ffurfweddu mewnbwn yn gydnaws â'r fersiwn hon o STK.

source: Guide
cy: Canllaw

source: Start
cy: Cychwyn

source: Left thumbstick press
cy: Pwyso bawd chwith

source: Right thumbstick press
cy: Pwyso bawd dde

source: Left shoulder
cy: Ysgwydd chwith

source: Right shoulder
cy: Ysgwydd dde

source: DPad up
cy: DPad i fyny

source: DPad down
cy: DPad i lawr

source: DPad left
cy: DPad chwith

source: DPad right
cy: DPad de

source: Left thumbstick right
cy: Ffon bawd chwith i'r dde

source: Left thumbstick left
cy: Ffon bawd chwith i'r chwith

source: Left thumbstick down
cy: Ffon bawd chwith i lawr

source: Left thumbstick up
cy: Ffon bawd chwith i fyny

source: Right thumbstick right
cy: Ffon bawd dde i'r dde

source: Right thumbstick left
cy: Ffon bawd dde i'r chwith

source: Right thumbstick down
cy: Ffon bawd dde i lawr

source: Right thumbstick up
cy: Ffon bawd dde i fyny

source: Left trigger
cy: Sbardun chwith

source: Right trigger
cy: Sbardun de

source: Ignoring '%s'. You needed to join earlier to play!
cy: Yn anwybyddu '%s'. Roedd angen ymuno yn gynt i chwarae!

source: Only the Game Master may act at this point!
cy: Dim ond Meistr y Gêm all weithredu ar y pwynt hwn!

source: %s has low battery level.
cy: Mae gan %s lefel batri isel.

source: Connect your wiimote to the Bluetooth manager, then click on Ok. Detailed instructions at https://supertuxkart.net/Wiimote
cy: Cysyllta dy Wiimote â'r rheolwr Bluetooth, yna clicia ar Iawn. Cyfarwyddiadau manwl yn https://supertuxkart.net/Wiimote

source: Press the buttons 1+2 simultaneously on your wiimote to put it in discovery mode, then click on Ok. Detailed instructions at https://supertuxkart.net/Wiimote
cy: Pwysa'r botymau 1+2 ar yr un pryd ar dy Wiimote i'w roi yn y modd darganfod, yna clicio Iawn. Cyfarwyddiadau manwl yn https://supertuxkart.net/Wiimote

source: Found %d wiimote
cy: Wedi darganfod %d Wiimote

source: Could not detect any wiimote :/
cy: Methu darganfod unrhyw Wiimote :/

source: Getting ready to race
cy: Yn paratoi i rasio

source: Penalty time!!
cy: Amser cosb!!

source: Don't accelerate before 'Set!'
cy: Paid â chyflymu cyn 'Barod!'

source: You can have at most 3 lives!
cy: Mae gyda ti 3 bywyd ar y mwyaf!

source: +1 life.
cy: +1 bywyd.

source: You were too slow!
cy: Roeddet ti'n rhy araf!

source: You finished the race!
cy: Rydych wedi gorffen y ras!

source: You won the race!
cy: Rwyt ti wedi ennill y ras!

source: You finished the race in rank %d!
cy: Rwyt ti wedi gorffen y ras yn safle %d!

source: %s left the game.
cy: Mae %s wedi gadael y gêm.

source: SuperTuxKart may connect to a server to download add-ons and notify you of updates. Please read our privacy policy at https://supertuxkart.net/Privacy. Would you like this feature to be enabled? (To change this setting at a later time, go to options, select tab 'General', and edit "Connect to the Internet").
cy: Gall SuperTuxKart gysylltu â gweinydd i lwytho ychwanegion i lawr a rhoi gwybod i ti am ddiweddariadau. Darllena'n polisi preifatrwydd yn https://supertuxkart.net/Privacy. Hoffet ti i'r nodwedd hon gael ei galluogi? (I newid y gosodiad hwn yn nes ymlaen, rhaid mynd i'r Dewisiadau, dewis tab 'Cyffredinol', a golygu "Cysylltu â'r Rhyngrwyd").

source: Your screen resolution is too low to run STK.
cy: Mae cydraniad dy sgrin yn rhy isel i redeg STK.

source: Your driver version is too old. Please install the latest video drivers.
cy: Mae fersiwn dy yrrwr yn rhy hen. Gosoda'r gyrwyr fideo diweddaraf.

source: Your graphics driver appears to be very old. Please check if an update is available. SuperTuxKart recommends a driver supporting %s or better. The game will likely still run, but in a reduced-graphics mode.
cy: Mae'n ymddangos bod dy yrrwr graffeg yn hen iawn. Gwiria a oes diweddariad ar gael. Mae SuperTuxKart yn argymell gyrrwr sy'n cefnogi %s neu well. Mae'n debyg y bydd y gêm yn dal i redeg, ond mewn modd graffeg lai.

source: Server connection timed out.
cy: Cysylltiad gweinydd wedi dod i ben.

source: %s has the red flag!
cy: Mae gan %s y faner goch!

source: The red flag has returned!
cy: Mae'r faner goch wedi dychwelyd!

source: %s has the blue flag!
cy: Mae gan %s y faner las!

source: The blue flag has returned!
cy: Mae'r faner las wedi dychwelyd!

source: %s captured the blue flag!
cy: Mae %s wedi cipio'r faner las!

source: %s captured the red flag!
cy: Mae %s wedi cipio'r faner goch!

source: Eggs: %d / %d
cy: Wyau: %d / %d

source: Leader
cy: Arweinydd

source: Final lap!
cy: Lap olaf!

# fastest_lap
source: %s by %s
cy: %s gan %s

source: New fastest lap
cy: Lap cyflymaf newydd

source: WRONG WAY!
cy: Y FFORDD ANGHYWIR!

source: %s scored a goal!
cy: Mae %s wedi sgorio gôl!

source: Oops, %s made an own goal!
cy: Wps, mae %s wedi sgorio yn ei gôl ei hun!

source: %i spare tire kart has been spawned!
cy: Mae %i cart teiars sbâr wedi'i greu!

source: You have been eliminated!
cy: Rwyt ti allan o'r gêm!

source: '%s' has been eliminated.
cy: Mae '%s'allan o'r gêm.

source: Server has been shut down.
cy: Mae'r gweinydd wedi'i gau.

source: You were kicked from the server.
cy: Rwyt ti wedi dy daro allan o'r gweinydd.

source: You were kicked: Ping too high.
cy: Rwyt ti wedi dy daro allan: Ping rhy uchel.

source: Bad network connection is detected.
cy: Wedi canfod cysylltiad rhwydwaith gwael.
