Repository: ornfelt/stk-code
Catalog: data/po/*.po
Languages: cy

source: %s disconnected.
cy: %s wedi'i ddatgysylltu.

source: Press player name in the list for player management and ranking information.
cy: Pwysa enw'r chwaraewr yn y rhestr i gael gwybodaeth am reoli a mesur chwaraewyr.

source: Difficulty: %s
cy: Anhawster: %s

source: Max players: %d
cy: Uchafswm chwaraewyr: %d

source: Game mode: %s
cy: Modd gêm: %s

source: Time limit
cy: Terfyn amser

source: Goals limit
cy: Terfyn goliau

source: Soccer game type: %s
cy: Math o gêm bêl-droed: %s

source: Grand prix progress: %d / %d
cy: Cynnydd Grand Prix: %d / %d

source: All players joined red or blue team.
cy: Ymunodd pob chwaraewr â thîm coch neu las.

source: You are now the owner of server.
cy: Ti nawr yw perchennog y gweinydd.

source: Connection refused: Server is busy.
cy: Gwrthodwyd y cysylltiad: Mae'r gweinydd yn brysur.

source: Connection refused: You are banned from the server.
cy: Gwrthodwyd y cysylltiad: Rwyt ti wedi dy wahardd o'r gweinydd.

source: Connection refused: Server password is incorrect.
cy: Gwrthodwyd y cysylltiad: Mae cyfrinair y gweinydd yn anghywir.

source: Connection refused: Game data is incompatible.
cy: Gwrthodwyd y cysylltiad: Mae data gêm yn anghydnaws.

source: Connection refused: Server is full.
cy: Gwrthodwyd y cysylltiad: Gweinydd yn llawn.

source: Connection refused: Invalid player connecting.
cy: Gwrthodwyd y cysylltiad: Cyswllt chwaraewr annilys.

source: Failed to start the network game.
cy: Wedi methu cychwyn y gêm rhwydwaith.

source: The game has ended, you can't live join or spectate anymore.
cy: Mae'r gêm wedi dod i ben, nid oes modd i ti ymuno na gwylio'n fyw bellach.

source: No remaining place in the arena - live join disabled.
cy: Dim lle ar ôl yn yr arena - mae ymuno'n fyw wedi ei analluogi.

source: Only 1 player remaining, returning to lobby.
cy: Dim ond 1 chwaraewr ar ôl, yn mynd i'r cyntedd.

source: Server owner quit the game.
cy: Mae perchennog y gweinydd yn gadael y gêm.

source: You will be spectating the next game.
cy: Byddi'n gwylio'r gêm nesaf.

source: %s joined the red team.
cy: Ymunodd %s â'r tîm coch.

source: %s joined the blue team.
cy: Ymunodd %s â'r tîm glas.

source: %s joined the game.
cy: Ymunodd %s â'r gêm.

source: Press <%s> or <%s> to change the targeted player, <%s> or <%s> for the camera position.
cy: Pwysa <%s> neu <%s> i newid y chwaraewr targed, <%s> neu <%s> leoliad y camera.

source: Successfully reported %s.
cy: Wedi adrodd ar %s yn llwyddiannus.

source: Failed to download assets, check your storage space or internet connection and try again later.
cy: Wedi methu â llwytho asedau i lawr, gwiria dy ofod storio neu gysylltiad rhyngrwyd a rho gynnig arall arni yn nes ymlaen.

source: No quick play server available.
cy: Dim gweinydd chwarae cyflym ar gael.

source: Cannot connect to server %s.
cy: Methu cysylltu â gweinydd %s.

source: Failed to detect port number for server %s.
cy: Wedi methu canfod rhif porth ar gyfer gweinydd %s.

source: Network grand prix has been finished.
cy: Rhwydwaith Grand Prix wedi gorffen.

source: Time Trial (Grand Prix)
cy: Treialon Amser (Grand Prix)

source: Free-For-All
cy: Rhydd-i-Pawb

source: Capture The Flag
cy: Cipio'r Faner

source: %s is now online.
cy: Mae %s nawr ar-lein.

source: %s and %s are now online.
cy: Mae %s a %s ar-lein nawr.

source: %s, %s and %s are now online.
cy: Mae %s, %s a %s ar-lein nawr.

source: %d friend is now online.
cy: Mae %d ffrind ar-lein nawr.

source: %s is now on server "%s".
cy: Mae %s nawr ar weinydd "%s".

source: You have %d new friend request!
cy: Mae gennyt %d cais ffrind newydd!

source: You have a new friend request!
cy: Mae gennyt gais ffrind newydd!

source: Unable to connect to the server. Check your internet connection or try again later.
cy: Methu cysylltu â'r gweinydd. Gwiria dy gysylltiad rhyngrwyd neu geisio eto yn nes ymlaen.

source: Default
cy: Rhagosodiad

source: None
cy: Dim

source: Random
cy: Ar Hap

source: The highscore file was too old, all highscores have been erased.
cy: Roedd y ffeil sgôr uchel yn rhy hen, mae pob sgôr uchel wedi'u dileu.

source: Follow the Leader
cy: Dilyn yr Arweinydd

source: 3 Strikes Battle
cy: Brwydr 3 Hergwd

source: Incomplete replay file will not be saved.
cy: Fydd y ffeil ailchwarae anghyflawn ddim yn cael ei chadw.

source: Replay saved in "%s".
cy: Ailchwarae wedi'i gadw yn "%s".

source: 1 week
cy: 1 wythnos

source: 2 weeks
cy: Pythefnos

source: 1 month
cy: 1 mis

source: 3 months
cy: 3 mis

source: 6 months
cy: 6 mis

source: 9 months
cy: 9 mis

source: 1 year
cy: Blwyddyn

source: 2 years
cy: 2 flynedd

source: Add-on name
cy: Enw ychwanegyn

source: Updated date
cy: Dyddiad wedi'i ddiweddaru

source: Not installed
cy: Heb ei osod

# addons
source: %s by %s
cy: %s gan %s

source: Please wait while addons are updated
cy: Arhosa tra bod yr ychwanegion yn cael eu diweddaru

source: Sorry, an error occurred while contacting the add-ons website. Make sure you are connected to the Internet and that SuperTuxKart is not blocked by a firewall
cy: Ymddiheuriadau, bu gwall wrth gysylltu â'r wefan ychwanegion. Gwna'n siŵr dy fod wedi dy gysylltu â'r Rhyngrwyd ac nad oes mur cadarn yn rhwystro SuperTuxKart

source: Favorites
cy: Ffefrynnau

source: Locked : solve active challenges to gain access to more!
cy: O dan glo: datrysa heriau gweithredol i gael mynediad at ragor!

source: Random Arena
cy: Arena ar Hap

source: translator-credits
cy: Rhoslyn Prys post@meddal.com

# achievement_info
source: Subgoals
cy: Is-nodau

# achievement_info
source: Progress
cy: Cynnydd

source: Fulfill all the subgoals
cy: Cyflawnu'r holl is-nodau

source: Fulfill all the subgoals at the same time
cy: Cyflawnu'r holl is-nodau ar yr un pryd

source: Fulfill at least one subgoal
cy: Cyflawnu o leiaf un is-nod

source: The sum of the subgoals must reach the indicated value
cy: Rhaid i swm yr is-nodau gyrraedd y gwerth sy'n cael ei nodi

source: Races won
cy: Rasys wedi'u hennill

source: Normal races won
cy: Rasys arferol wedi'u hennill

source: Time-trial races won
cy: Rasys Treialon amser wedi'u hennill

source: Follow-the-Leader races won
cy: Rasys Dilyn yr Arweinydd wedi eu hennill

source: Consecutive won races
cy: Rasys Olynol wedi'u hennill

source: Consecutive won races in Expert or SuperTux
cy: Rasys Arbenigwr neu SuperTux olynol wedi'u hennill

source: Novice races started
cy: Rasys Dechreuwyr wedi'u cychwyn

source: Novice races finished
cy: Rasys Dechreuwyr wedi'u gorffen

source: Intermediate races started
cy: Rasys Canolraddol wedi'u cychwyn

source: Intermediate races finished
cy: Rasys Canolradd wedi'u gorffen

source: Expert races started
cy: Rasys Arbenigwyr wedi'u cychwyn

source: Expert races finished
cy: Rasys Arbenigwyr wedi'u gorffen

source: SuperTux races started
cy: Rasys SuperTux wedi'u cychwyn

source: SuperTux races finished
cy: Rasys SuperTux wedi'u gorffen

source: Normal races started
cy: Rasys Arferol wedi'u cychwyn

source: Normal races finished
cy: Rasys Arferol wedi'u gorffen

source: Time-trial races started
cy: Rasys Treialon Amser wedi'u cychwyn

source: Time-trial races finished
cy: Rasys Treialon Amser wedi'u cychwyn

source: Follow-the-Leader races started
cy: Rasys Dilyn yr Arweinydd wedi'u cychwyn

source: Follow-the-Leader races finished
cy: Rasys Dilyn yr Arweinydd wedi'u gorffen

source: 3 Strikes battles started
cy: Brwydrau 3 Hergwd wedi'u cychwyn

source: 3 Strikes battles finished
cy: Brwydrau 3 Hergwd wedi'u gorffen

source: Soccer matches started
cy: Gemau Pêl-droed wedi'u cychwyn

source: Soccer matches finished
cy: Gemau Pêl-droed wedi'u gorffen

source: Egg Hunts started
cy: Helfeydd Wyau wedi'u dechau

source: Egg Hunts finished
cy: Helfeydd Wyau wedi'u gorffen

source: Races started with a ghost replay
cy: Rasys ailchwarae ysbrydion wedi'u cychwyn

source: Races finished with a ghost replay
cy: Rasys ailchwarae ysbrydion wedi'u gorffen

source: Capture-the-Flag matches started
cy: Gemau Cipio'r Faner wedi'u cychwyn

source: Capture-the-Flag matches finished
cy: Gemau Cipio'r Faner wedi'u gorffen

source: Free-for-All matches started
cy: Gemau Rhydd i Bawb wedi'u cychwyn

source: Free-for-All matches finished
cy: Gemau Rhydd i Bawb wedi'u gorffen

source: Powerups used
cy: Pweriadau wedi'u defnyddio

source: (1 race)
cy: (1 ras)

source: Bowling ball hits
cy: Trawiadau pêl bowlio

source: Swatter hits
cy: Trawiadau Swatiwr

source: All hits
cy: Pob trawiad

source: Hits against the same kart
cy: Trawiadau yn erbyn yr un cart

source: Bananas collected
cy: Bananas wedi'u casglu

source: Skidding
cy: Sgidio

source: Races started
cy: Rasys wedi'u cychwyn

source: (maximum on one official track)
cy: (uchafswm ar un trac swyddogol)

source: Races finished
cy: Rasys wedi'u gorffen

source: Reverse direction races finished
cy: Rasys am yn ôl wedi gorffen

source: Races finished alone
cy: Rasys wedi'u gorffen ar ben fy hun

source: Races with less than the default lap number
cy: Rasys gyda llai na'r rhif lap rhagosodedig

source: Races with more than the default lap number
cy: Rasys gyda mwy na'r rhif lap rhagosodedig

source: Races with at least twice as much as the default lap number
cy: Rasys gydag o leiaf ddwywaith cymaint â'r rhif lap rhagosodedig

source: Egg hunts started
cy: Helfeydd Wyau wedi'u dechau

source: Egg hunts finished
cy: Helfeydd Wyau wedi'u gorffen

source: (official tracks matching the goal)
cy: (traciau swyddogol yn cyfateb i'r nod)

source: New gamepads and joysticks will automatically appear in the list when you connect them to this device. To add a keyboard config, you can use the button below, HOWEVER please note that most keyboards only support a limited amount of simultaneous keypresses and are thus inappropriate for multiplayer gameplay. (You can, however, connect multiple keyboards to this device. Remember that everyone still needs different keybindings in this case.)
cy: Bydd padiau gêm a ffyn rheoli newydd yn ymddangos yn awtomatig yn y rhestr pan fyddi'n eu cysylltu â'r ddyfais hon. I ychwanegu ffurfweddiad bysellfwrdd, gelli ddefnyddio'r botwm isod, FODD BYNNAG sylwa fod y rhan fwyaf o fysellfyrddau ond yn cynnal nifer gyfyngedig o fysellau bysellfyrddau ac felly'n anaddas ar gyfer chwarae aml-chwaraewr. (Gelli hefyd gysylltu nifer o fysellfyrddau i'r ddyfais hon. Cofia fod angen dynodiad bysellfyrddau gwahanol ar bawb o hyd yn yr achos hwn.)

source: Add Wiimote
cy: Ychwanegu Wiimote

source: Add Keyboard Configuration
cy: Ychwanegu Ffurfweddiad Bysellfwrdd

source: Update
cy: Diweddariad

source: Version: %d
cy: Fersiwn: %d

source: featured
cy: nodwedd

source: Size: %s
cy: Maint: %s

source: You must be logged in to rate this addon.
cy: Rhaid i chi fod wedi mewngofnodi i raddio'r ategyn hwn.

source: Sorry, downloading the add-on failed
cy: Ymddiheuriad, nid oedd modd llwytho'r ychwanegyn i lawr

source: Problems installing the addon '%s'.
cy: Problemau wrth osod yr ategyn '%s'.

source: Try again
cy: Ceisia eto

source: Problems removing the addon '%s'.
cy: Problemau wrth dynnu'r ategyn '%s'.

source: Background download completed.
cy: Cwblhawyd y llwytho i lawr yn y cefndir.

source: Background download
cy: Llwytho i lawr yn y cefndir

source: Background download has already started.
cy: Mae llwytho i lawr yn y cefndir eisoes wedi cychwyn.

source: Current password invalid.
cy: Cyfrinair presennol yn annilys.

source: Password has to be between 8 and 30 characters long!
cy: Rhaid i'r cyfrinair fod rhwng 8 a 30 nod o hyd!

source: Passwords don't match!
cy: Nid yw'r cyfrineiriau yn cydweddu!

source: Validating info
cy: Yn dilysu manylion

source: Password successfully changed.
cy: Newidiwyd y cyfrinair yn llwyddiannus.

source: Confirm resolution within %i second
cy: Cadarnhau'r cydraniad o fewn %i eiliad

source: Resolutions smaller than 1024x768 or 1280x720 are unsupported. Some parts of the UI may not work correctly.
cy: Nid yw cydraniadau sy'n llai na 1024x768 neu 1280x720 yn cael eu cefnogi. Efallai na fydd rhai rhannau o'r Rhyngwyneb yn gweithio'n iawn.

source: Drone chase
cy: Hela drôn

source: Custom
cy: Cyfaddas

source: Disabled
cy: Analluogwyd

source: Important only
cy: Pwysig yn unig

source: Very Low
cy: Isel Iawn

source: Low
cy: Isel

source: Medium
cy: Canolig

source: High
cy: Uchel

source: Very High
cy: Uchel Iawn

source: Ultra
cy: Llawn

source: SuperTuxKart will download full assets (including high quality textures and music) for better gaming experience, this will use your mobile data if you don't have a wifi connection.
cy: Bydd SuperTuxKart yn llwytho asedau llawn i lawr (gan gynnwys gweadau a cherddoriaeth o ansawdd uchel) ar gyfer gwell profiad hapchwarae, bydd hyn yn defnyddio'ch data symudol os nad oes gennych gysylltiad wifi.

source: SuperTuxKart will download full assets (including high quality textures and music) for better gaming experience.
cy: Bydd SuperTuxKart yn llwytho asedau llawn i lawr (gan gynnwys gweadau a cherddoriaeth o ansawdd uchel) ar gyfer gwell profiad hapchwarae.

source: Enter the server address optionally followed by : and then port or select address from list.
cy: Rhowch gyfeiriad y gweinydd ac o ddewis rhowch : ac yna nodi porth neu dewiswch gyfeiriad o'r rhestr.

source: Invalid server address: %s.
cy: Cyfeiriad gweinydd annilys: %s.

# column_name
source: Reverse
cy: Am yn Ôl

# column_name
source: Difficulty
cy: Anhawster

# column_name
source: Laps
cy: Lapiau

# column_name
source: Time
cy: Amser

# column_name
source: Kart
cy: Cart

# column_name
source: User
cy: Defnyddiwr

# column_name
source: Version
cy: Fersiwn

source: No
cy: Na

source: Track
cy: Trac

source: Top %d High Scores
cy: Y %d Sgôr Uchel Uchaf

source: Number of karts: %d
cy: Nifer y cartiau: %d

source: Time target: %s
cy: Targed amser: %s

source: Laps: %d
cy: Lapiau: %d

source: Reverse: %s
cy: Am yn Ôl: %s

source: (Empty)
cy: (Gwag)

source: Use original color
cy: Defnyddio'r lliw gwreiddiol

source: Pick a color from slider
cy: Dewis lliw o'r llithrydd

source: Don't show again
cy: Peidio â dangos eto

source: Player info
cy: Manylion chwaraewr

source: Player name: %s
cy: Enw'r chwaraewr: %s

source: Player location: %s
cy: Lleoliad y chwaraewr: %s

source: Kick
cy: Cic

source: Change team
cy: Newid tîm

source: Enable handicap
cy: Galluogi anfantais

source: Disable handicap
cy: Analluogi anfantais

source: Report player
cy: Adrodd ar chwaraewr

source: Fetching ranking info for %s
cy: Wrthi'n nôl manylion llwyddiant %s

source: Tell server administrator about this player (%s):
cy: Dweud wrth weinyddwr y gweinydd am y chwaraewr hwn (%s):

source: Press any key... (Press ESC to cancel)
cy: Pwyso unrhyw fysell... (Pwysa ESC i ddiddymu)

source: Press any key...
cy: Pwyso unrhyw fysell...

source: Chat is disabled, enable in options menu.
cy: Mae Sgwrsio wedi'i analluogi, galluoga yn y ddewislen Dewisiadau.

source: Back to the Performance Test
cy: Yn ôl i'r Prawf Perfformiad

source: Exit the Performance Test
cy: Gadael y Prawf Perfformiad

source: Back to Battle
cy: Nôl i'r Frwydr

source: Setup New Game
cy: Gosod Gêm Newydd

source: Restart Battle
cy: Ailgychwyn y Frwydr

source: Exit Battle
cy: Gadael y Frwydr

source: Setup New Race
cy: Gosod Ras Newydd

source: Exit Race
cy: Gadael y Ras

source: %s has no ranking yet.
cy: Nid oes gan %s raddiad eto.

source: %s is number %d in the rankings with a score of %f.
cy: Mae %s yn rhif %d yn y graddio gyda sgôr o %f.

source: Username and/or email address invalid.
cy: Enw defnyddiwr a/neu gyfeiriad e-bost annilys.

source: Please read the terms and conditions for SuperTuxKart at '%s'. You must agree to these terms in order to register an account for STK. If you have any questions or comments regarding these terms, one of the members of the development team would gladly assist you.
cy: Darllena'r telerau ac amodau ar gyfer SuperTuxKart yn '%s'. Rhaid i ti gytuno i'r telerau hyn er mwyn cofrestru cyfrif ar gyfer STK. Os oes gennyt unrhyw gwestiynau neu sylwadau am y telerau hyn, byddai un o aelodau'r tîm datblygu yn falch o dy gynorthwyo.

source: Nitro challenge
cy: Her Nitro

source: Ghost replay race
cy: Ras ailchwarae ysbrydion

source: Laps: %i
cy: Lapiau: %i

source: Type: %s
cy: Math: %s

source: Required Rank: %i
cy: Safle Gofynnol: %i

source: Required Time: %i
cy: Amser Angenrheidiol: %i

source: Required Nitro Points: %i
cy: Pwyntiau Nitro Gofynnol: %i

source: Number of AI Karts: %i
cy: Nifer y Cartiau AI: %i

source: Battle mode
cy: Modd brwydr

source: Soccer game type
cy: Math o gêm bêl-droed

source: Server location: %s
cy: Lleoliad y gweinydd: %s

source: Current track: %s
cy: Trac cyfredol: %s

source: Rank
cy: Safle

source: Player
cy: Chwaraewr

source: Scores
cy: Sgorau

source: Time played
cy: Amser chwaraewyd

source: Remove from bookmarks
cy: Tynnu o'r nodau tudalennau

source: Input device already exists.
cy: Mae dyfais fewnbynnu eisoes yn bodoli.

source: No player available for connecting to server.
cy: Nid oes chwaraewr ar gael i gysylltu â'r gweinydd.

source: Username: %s
cy: Enw defnyddiwr: %s

source: Cancel Request
cy: Diddymu'r Cais

source: Today
cy: Heddiw

source: Friend request sent!
cy: Cais ffrind wedi'i anfon!

source: Friend request accepted!
cy: Cais ffrind wedi'i dderbyn!

source: Friend request declined!
cy: Cais ffrind wedi'i wrthod!

source: Friend removed!
cy: Ffrind wedi'i dynnu!

source: Friend request cancelled!
cy: Cais ffrind wedi'i diddymu!

source: Processing
cy: Prosesu

source: Fetching last vote
cy: Yn estyn y bleidlais ddiwethaf

source: You can adapt your previous rating by clicking the stars beneath.
cy: Gelli addasu dy sgôr blaenorol trwy glicio ar y sêr oddi tano.

source: You have not yet voted for this addon. Select your desired rating by clicking the stars beneath
cy: Nid wyt wedi pleidleisio dros yr ategyn hwn eto. Dewisa sgôr dymunol trwy glicio ar y sêr isod

source: Vote successful! You can now close the window.
cy: Pleidlais yn llwyddiannus! Nawr gelli gau'r ffenestr.

source: Performing vote
cy: Wrthi'n pleidleisio

source: Random Track
cy: Trac ar Hap

source: Are you sure you want to remove '%s'?
cy: Wyt ti'n siŵr dy fod am dynnu '%s'?

source: Do you want to save your changes?
cy: Wyt ti eisiau cadw dy newidiadau?

source: Laps
cy: Lapiau

source: Reversed
cy: Am yn Ôl

source: An error occurred while trying to save your grand prix.
cy: Digwyddodd gwall wrth geisio cadw dy Grand Prix.

source: Select a track
cy: Dewisa drac

source: You completed the easy challenge! Points earned on this level: %i/%i
cy: Rwyt ti wedi cwblhau'r her hawdd! Pwyntiau wedi'u hennill ar y lefel hon: %i/%i

source: You completed the intermediate challenge! Points earned on this level: %i/%i
cy: Rwyt ti wedi cwblhau'r her ganolradd! Pwyntiau wedi'u hennill ar y lefel hon: %i/%i

source: You completed the difficult challenge! Points earned on this level: %i/%i
cy: Rwyt ti wedi cwblhau'r her anodd! Pwyntiau wedi'u hennill ar y lefel hon: %i/%i

source: You completed the SuperTux challenge! Points earned on this level: %i/%i
cy: Rwyt ti wedi cwblhau'r her SuperTux! Pwyntiau wedi'u hennill ar y lefel hon: %i/%i

source: You unlocked %s!
cy: Rwyt ti wedi datgloi %s!

source: Challenge Completed
cy: Wedi'i Chwblhau'r Her

source: You unlocked track %0
cy: Rwyt wedi datgloi trac %0

source: You unlocked grand prix %0
cy: Rwyt wedi datgloi grand prix %0

# column_name
source: Track
cy: Trac

# column_name
source: Players
cy: Chwaraewyr

source: Reload
cy: Ail-lwytho

source: Please enter the name of the grand prix
cy: Rho enw'r grand prix

source: Please select a Grand Prix
cy: Dewisa Grand Prix

source: User defined
cy: Defnyddiwr diffiniedig

source: Name is empty.
cy: Mae'r enw'n wag.

source: Another grand prix with this name already exists.
cy: Mae grand prix arall gyda'r enw hwn eisoes yn bodoli.

source: Name is too long.
cy: Mae'r enw'n rhy hir.

source: Better luck next time!
cy: Gwell lwc tro nesa!

source: You completed a challenge!
cy: Rwyt ti wedi cwblhau her!

source: You won the Grand Prix!
cy: Rwyt ti wedi ennill y Grand Prix!

source: You completed the Grand Prix!
cy: Rwyt ti wedi cwblhau'r Grand Prix!

# column_name
source: Number of karts
cy: Nifer y cartiau

source: Are you sure you want to remove this high score entry?
cy: Wyt ti'n siŵr dy fod am ddileu'r cofnod sgôr uchel hwn?

source: Are you sure you want to remove all of your high scores?
cy: Wyt ti'n siŵr dy fod am ddileu dy holl gofnodion sgôr uchel?

source: Favorite
cy: Hoffi

source: Light
cy: Ysgafn

source: Heavy
cy: Trwm

source: Connect a keyboard or gamepad to play splitscreen multiplayer
cy: Cysyllta fysellfwrdd neu bad gemau i chwarae sgrin hollt aml-chwaraewr

source: Random Kart
cy: Cart ar Hap

source: Locked
cy: Wedi Cloi

source: Everyone: Press the 'Select' button to join the game
cy: Pawb: Pwyswch y botwm 'Dewis' i ymuno â'r gêm

source: Would you like to play the tutorial of the game?
cy: Hoffet ti chwarae tiwtorial y gêm?

source: You can not play online without internet access. If you want to play online, go in the options menu, and check "Connect to the Internet".
cy: Nid oes modd i ti chwarae ar-lein heb fynediad i'r rhyngrwyd. Os wyt ti eisiau chwarae ar-lein, rhaid mynd i'r ddewislen Dewisiadau, a thicio "Cysylltu â'r Rhyngrwyd".

source: You can not download addons without internet access. If you want to download addons, go in the options menu, and check "Connect to the Internet".
cy: Nid oes modd i ti lwytho ategion i lawr heb fynediad i'r rhyngrwyd. Os wyt ti eisiau chwarae ar-lein, rhaid mynd i'r ddewislen Dewisiadau, a thicio "Cysylltu â'r Rhyngrwyd".

source: You can not download addons without internet access. If you want to download addons, go in the options menu, and check "Connect to the Internet". You can however delete already downloaded addons.
cy: Nid oes modd i ti lwytho ategion i lawr heb fynediad i'r rhyngrwyd. Os wyt ti eisiau chwarae ar-lein, rhaid mynd i'r ddewislen Dewisiadau, a thicio "Cysylltu â'r Rhyngrwyd". Fodd bynnag, mae modd i ti ddileu ategion sydd eisoes wedi'u llwytho i lawr.

source: The add-ons module is currently disabled in the Options screen
cy: Mae'r modiwl ychwanegion wedi'i analluogi ar hyn o bryd yn y sgrin Dewisiadau

source: Please wait while the add-ons are loading
cy: Arhosa tra bod yr ychwanegion yn llwytho

source: Are you sure you want to quit STK?
cy: Wyt ti'n siŵr dy fod am adael STK?

source: Create LAN Server
cy: Creu Gweinydd LAN

source: %s's server
cy: Gweinydd %s

source: No. of grand prix track(s)
cy: Nifer y trac(iau) grand prix

source: Name has to be between 4 and 30 characters long!
cy: Rhaid i'r enw fod rhwng 4 a 30 nod o hyd!

source: Incorrect characters in password!
cy: Mae nodau anghywir yn y cyfrinair!

source: Ready
cy: Parod

source: Live join
cy: Ymuno'n fyw

source: Spectate
cy: Gwylio

source: Install addon
cy: Gosod ychwanegyn

source: Please wait for the current game's (%s) end, estimated remaining time: %s.
cy: Arhosa hyd ddiwedd y gêm gyfredol (%s), amcangyfrif o faint sy'n weddill: %s.

source: Please wait for the current game's end, estimated remaining time: %s.
cy: Arhosa hyd ddiwedd y gêm gyfredol, amcangyfrif o faint sy'n weddill: %s.

source: Please wait for the current game's (%s) end, estimated progress: %s%.
cy: Arhosa hyd ddiwedd y gêm gyfredol (%s), amcangyfrif o faint sy'n weddill: %s%.

source: Please wait for the current game's end, estimated progress: %d%.
cy: Arhosa hyd ddiwedd y gêm gyfredol, amcangyfrif o'r cynnydd: %d%.

source: Please wait for the current game's end.
cy: Arhosa hyd ddiwedd y gêm gyfredol.

source: Game will start if there is more than %d player.
cy: Bydd y gêm yn cychwyn os oes mwy na %d chwaraewr.

source: Starting after %d second, or once everyone has pressed the 'Ready' button.
cy: Yn cychwyn ar ôl %d eiliad, neu unwaith mae pawb wedi pwyso'r botwm 'Barod'.
