Repository: ornfelt/stk-code
Catalog: data/po/*.po
Languages: cy

source: Connecting to server %s
cy: Yn cysylltu â gweinydd %s

source: Finding a quick play server
cy: Yn canfod gweinydd chwarae cyflym

source: Remaining time: %d
cy: Amser yn weddill: %d

source: Goals
cy: Nodau

source: Fetching achievements
cy: Yn estyn cyflawniadau

source: %s's profile
cy: Proffil %s

source: Since
cy: Ers

source: Status
cy: Statws

source: Fetching friends
cy: Yn estyn ffrindiau

source: New Request
cy: Cais Newydd

source: Pending
cy: Danystyriaeth

source: Offline
cy: All-lein

source: Enter new E-mail below
cy: Rho e-bost newydd isod

source: New Email has to be between 5 and 254 characters long!
cy: Rhaid i e-bost newydd fod rhwng 5 a 254 nod o hyd!

source: New Email is invalid!
cy: Mae'r e-bost newydd yn annilys!

source: E-mail changed!
cy: Mae'r e-bost wedi newid!

source: Failed to change E-mail: %s
cy: Wedi methu â newid e-bost: %s

source: News from STK Blog
cy: Newyddion o Flog STK

source: Date
cy: Dyddiad

source: There are currently no news available.
cy: Does dim newyddion ar gael ar hyn o bryd.

source: You must be logged in to play Global networking. Click your username above.
cy: Rhaid i ti fod wedi mewngofnodi i chwarae rhwydweithio byd-eang. Clicia ar dy enw defnyddiwr uchod.

source: Searching
cy: Yn chwilio

source: Exit game
cy: Gadael y gêm

source: Could not create player '%s'.
cy: Methu creu chwaraewr '%s'.

source: User name cannot be empty.
cy: Nid oes modd i enw defnyddiwr fod yn wag.

source: Online username and password must not be the same!
cy: Ddylai enw defnyddiwr a chyfrinair ar-lein ddim fod yr un peth!

source: Emails don't match!
cy: Nid yw'r e-byst yn cyfateb!

source: Online username can only contain alphanumeric (ASCII) characters, periods, dashes and underscores!
cy: Gall enw defnyddiwr ar-lein gynnwys dim ond nodau alffaniwmerig (ASCII), llinellau toriad a thanlinellau!

source: Online username has to be between 3 and 30 characters long!
cy: Rhaid i enw defnyddiwr ar-lein fod rhwng 3 a 30 nod o hyd!

source: Online username must not start with a number!
cy: Ddylai enw defnyddiwr ar-lein ddim cychwyn gyda rhif!

source: Email has to be between 5 and 254 characters long!
cy: Rhaid i e-bost newydd fod rhwng 5 a 254 nod o hyd!

source: Email is invalid!
cy: Mae'r e-bost yn annilys!

source: You will receive an email with further instructions regarding account activation. Please be patient and be sure to check your spam folder.
cy: Byddi'n derbyn e-bost gyda chyfarwyddiadau pellach ynghylch gweithredu cyfrif. Bydd yn amyneddgar a gwna'n siŵr i edrych yn dy ffolder sbam.

source: Internet access is disabled, please enable it in the options
cy: Mae mynediad i'r rhyngrwyd wedi'i analluogi, galluoga ef yn y Dewisiadau

# column_name
source: Name
cy: Enw

# column_name
source: Game mode
cy: Modd gêm

# column_name
source: Owner
cy: Perchennog

# column_name
source: Distance (km)
cy: Pellter (km)

source: Unknown
cy: Anhysbys

source: No IPv4 detected, you may not be able to join any servers.
cy: Heb ganfod IPv4, efallai na fyddi'n gallu ymuno ag unrhyw weinyddion.

source: No IPv6 detected, you may not be able to join any servers.
cy: Heb ganfod IPv6, efallai na fyddi'n gallu ymuno ag unrhyw weinyddion.

source: No server is available.
cy: Dim gweinydd ar gael.

source: Fetching servers
cy: Estyn gweinyddion

source: Server Bookmarks
cy: Nodau Tudalen Gweinyddion

source: If a majority of players all select the same track and race settings, voting will end early.
cy: Os bydd mwyafrif o chwaraewyr i gyd yn dewis yr un gosodiadau trac a ras, bydd y pleidleisio'n dod i ben yn gynnar.

source: Random item location
cy: Lleoliad eitem ar hap

source: Number of goals to win
cy: Nifer o nodau i'w hennill

source: Drive in reverse
cy: Gyrru am yn Ôl

source: Locked: solve active challenges to gain access to more!
cy: O dan glo: datrysa heriau gweithredol i gael mynediad at ragor!

source: Action
cy: Gweithredu

source: Key binding
cy: Dynodi bysell

source: Disable Device
cy: Analluogi Dyfais

source: Enable Device
cy: Galluogi Dyfais

source: Enable Configuration
cy: Galluogi Ffurfweddiad

source: Game Keys
cy: Bysellau Gêm

source: Menu Keys
cy: Bysellau Dewislen

source: Steer Left
cy: Llywio i'r Chwith

source: Steer Right
cy: Llywio i'r Dde

source: Accelerate
cy: Cyflymu

source: Brake / Reverse
cy: Brecio / Am yn Ôl

source: Fire
cy: Tânio

source: Look Back
cy: Edrych Nôl

source: Rescue
cy: Achub

source: Pause Game
cy: Oedi Gêm

source: Up
cy: I fyny

source: Down
cy: I lawr

source: Left
cy: Chwith

source: Right
cy: De

source: Select
cy: Dewis

source: Cancel/Back
cy: Na/Nôl

source: * A blue item means a conflict with another configuration
cy: * Mae eitem las yn golygu gwrthdaro â ffurfweddiad arall

source: * A red item means a conflict in the current configuration
cy: * Mae eitem goch yn golygu gwrthdaro yn y ffurfweddiad cyfredol

source: Warning: The 'Shift' is not a recommended key. When 'Shift' is pressed down, all keys that contain a character that is different in upper-case will stop working.
cy: Rhybudd: Nid yw'r 'Shift' yn fysell sy'n cael ei argymell. Pan fydd 'Shift' yn cael ei bwyso, bydd pob bysell sy'n cynnwys nod sy'n wahanol mewn priflythrennau yn stopio gweithio.

source: Are you sure you want to permanently delete this configuration?
cy: Wyt ti'n siŵr dy fod am ddileu'r ffurfweddiad hwn yn barhaol?

source: Enter new configuration name, leave empty to revert default value.
cy: Rho enw ffurfweddiad newydd, gad yn wag i adfer y gwerth rhagosodedig.

source: Vertical
cy: Fertigol

source: Horizontal
cy: Llorweddol

source: In multiplayer mode, players can select handicapped (more difficult) profiles on the kart selection screen
cy: Yn y modd aml-chwaraewr, gall chwaraewyr ddewis proffiliau anfanteisiol (anoddach) ar y sgrin dewis cart

source: Install full game assets
cy: Gosod asedau'r gêm llawn

source: Are you sure to uninstall full game assets?
cy: Wyt ti'n siŵr o fod eisiau dadosod asedau'r gêm llawn?

source: Keyboard %i
cy: Bysellfwrdd %i

source: Touch Device
cy: Dyfais Gyffwrdd

source: Tap on a device to configure it
cy: Tapia ar ddyfais i'w ffurfweddu

source: System Language
cy: Iaith y System

source: In the bottom-left
cy: Yn y gwaelod-chwith

source: On the right side
cy: Ar yr ochr dde

source: Hidden
cy: Cudd

source: Centered
cy: Canolwyd

source: Very small
cy: Bach iawn

source: Small
cy: Bach

source: Large
cy: Mawr

source: Very large
cy: Mawr iawn

source: Speedrun mode can only be enabled if the game has not been closed since the launch of the story mode. Closing the game before the story mode's completion invalidates the timer. To use the speedrun mode, please use a new profile.
cy: Dim ond os nad yw'r gêm wedi cau ers agor y modd stori y mae modd galluogi modd Rhedeg Cyflym. Mae cau'r gêm cyn cwblhau'r modd stori yn annilysu'r amserydd. I ddefnyddio'r modd Rhedeg Cyflym, defnyddia broffil newydd.

source: Vertical Sync
cy: Cyweddu Fertigol

source: Vsync forces the graphics card to supply a new frame only when the monitor is ready to display it.
cy: Mae Vsync yn gorfodi'r cerdyn graffeg i gyflenwi ffrâm newydd dim ond pan fydd y monitor yn barod i'w ddangos.

source: Vsync will not work if your drivers don't support it.
cy: Ni fydd Vsync yn gweithio os nad yw dy yrwyr yn ei gefnogi.

source: Particles Effects: %s
cy: Effeithiau Gronynnau: %s

source: Animated Characters: %s
cy: Nodau Animeiddiedig: %s

source: Dynamic lights: %s
cy: Goleuadau deinamig: %s

source: Light scattering: %s
cy: Gwasgaru golau: %s

source: Anti-aliasing: %s
cy: Gwrth-lyfnhau: %s

source: Ambient occlusion: %s
cy: Achludiad amgylchynol: %s

source: Shadows: %s
cy: Cysgodion: %s

source: Shadows: %i
cy: Cysgodion: %i

source: Bloom: %s
cy: Blŵm: %s

source: Glow (outlines): %s
cy: Tywynnu (Amlinelliadau): %s

source: Light shaft (God rays): %s
cy: Siafft golau (pelydrau Duw): %s

source: Rendered image quality: %s
cy: Ansawdd delwedd wedi'i rendro: %s

source: Geometry detail: %s
cy: Manylion geometreg: %s

source: Motion blur: %s
cy: Pwl symud: %s

source: Depth of field: %s
cy: Dyfnder ffocws: %s

source: Internet access is disabled. Do you want to enable it?
cy: Mae mynediad i'r rhyngrwyd wedi'i analluogi. Wyt ti am ei alluogi?

source: You need to enter a password.
cy: Mae angen i ti roi cyfrinair.

source: Logging out '%s'
cy: Allgofnodi '%s'

source: Logging in '%s'
cy: Mewngofnodi '%s'

source: You can't delete the only player.
cy: Nid oes modd i ti ddileu'r unig chwaraewr.

source: Do you really want to delete player '%s'?
cy: Wyt ti wir eisiau dileu chwaraewr '%s'?

source: Ready!
cy: Parod!

source: Set!
cy: Gosod!

source: Go!
cy: Mynd!

source: GOAL!
cy: GÔL!

source: Waiting for others
cy: Aros am eraill

source: Waiting for the server
cy: Aros am y gweinydd

source: by
cy: gan

source: Collect nitro!
cy: Casglu nitro!

source: Follow the leader!
cy: Dilyn yr arweinydd!

source: Top %i
cy: %i uchaf

source: Challenge Failed
cy: Her wedi Methu

source: Press podium icon to start tutorial
cy: Pwysa eicon y podiwm i agor y tiwtorial

source: Press fire to start the tutorial
cy: Pwysa tanio i gychwyn y tiwtorial

source: Press podium icon to start the challenge
cy: Pwysa eicon y podiwm i gychwyn yr her

source: Press fire to start the challenge
cy: Pwysa tanio i gychwyn yr her

source: Back to video settings
cy: Yn ôl i osodiadau fideo

source: Save the test results
cy: Cadw canlyniadau'r prawf

source: Back to main menu
cy: Yn ôl i'r brif ddewislen

source: Quit the server
cy: Gadael y gweinydd

source: Abort Grand Prix
cy: Gadael Grand Prix

source: Restart
cy: Ail gychwyn

source: Back to challenge selection
cy: Nôl i ddewis her

source: Race against the new ghost replay
cy: Ras yn erbyn yr ailchwarae ysbrydion newydd

source: Back to the menu
cy: Nôl i'r ddewislen

source: Do you really want to abort the Grand Prix?
cy: Wyt ti wir eisiau gadael y Grand Prix?

source: Performance report saved in "%s".
cy: Adroddiad perfformiad wedi'i gadw yn "%s".

source: Red Team Wins
cy: Mae'r Tîm Coch Wedi Ennill

source: Blue Team Wins
cy: Mae'r Tîm Glas Wedi Ennill

source: It's a draw
cy: Mae'n Gyfartal

source: Eliminated after %s
cy: Allan ar ôl %s

source: Eliminated
cy: Allan

source: (Own Goal)
cy: (I'w Rwyd ei Hun)

source: Track %i/%i
cy: Trac %i/%i

source: Grand Prix progress:
cy: Cynnydd Grand Prix:

source: Highscores
cy: Sgorau uchel

source: Best lap time: %s
cy: Yr amser lap gorau: %s

source: by %s
cy: gan %s

source: You completed the challenge!
cy: Rwyt wedi cwblhau'r her!

source: You failed the challenge!
cy: Rwyt wedi methu'r her!

source: Reached Requirements of SuperTux
cy: Wedi cyrraedd Gofynion SuperTux

source: Performance Test Results
cy: Canlyniadau Profion Perfformiad

source: Test duration: %s
cy: Hyd y prawf: %s

source: Number of frames: %s
cy: Nifer y fframiau: %s

source: Steady FPS: %s
cy: FPS cyson: %s

source: Mostly Steady FPS: %s
cy: FPS Sefydlog yn Bennaf: %s

source: Typical FPS: %s
cy: FPS nodweddiadol: %s

source: Horizontal resolution: %s
cy: Cydraniad llorweddol: %s

source: Vertical resolution: %s
cy: Cydraniad fertigol: %s

source: Dynamic lighting: ON
cy: Goleuo deinamig: YMLAEN

source: Dynamic lighting: OFF
cy: Goleuo deinamig: I FFWRDD

source: Render resolution: %s%%
cy: Cydraniad rendrad: %s%%

source: Anti-aliasing: ON
cy: Gwrth-aliasio: YMLAEN

source: Anti-aliasing : OFF
cy: Gwrth-aliasio: I FFWRDD

source: Image-based lighting: OFF
cy: Goleuo ar sail delwedd: I FFWRDD

source: Image-based lighting: ON
cy: Goleuo ar sail delwedd: YMLAEN

source: Ambient occlusion: ON
cy: Achludiad amgylchol: YMLAEN

source: Ambient occlusion: OFF
cy: Achludiad amgylchol: I FFWRDD

source: Shadow resolution: %s
cy: Cydraniad cysgodol: %s

source: All blows allowed, so catch weapons and make clever use of them!
cy: Yn caniatáu pob ergyd, felly cipia arfau a gwna ddefnydd clyfar ohonyn nhw!

source: Contains no powerups, so only your driving skills matter!
cy: Nid yw'n cynnwys unrhyw bweriadau, felly dim ond dy sgiliau gyrru sy'n bwysig!

source: Keep up with the leader kart but don't overtake it!
cy: Cadw fyny gyda chart yr arweinydd ond paid â'i basio!

source: Hit others with weapons until they lose all their lives.
cy: Taro eraill gydag arfau nes iddyn nhw golli eu bywydau i gyd.

source: Push the ball into the opposite cage to score goals.
cy: Gwthia'r bêl i'r cawell gyferbyn i sgorio goliau.

source: Explore tracks to find all hidden eggs
cy: Chwilia'r traciau i ddod o hyd i'r holl wyau cudd

source: Race against ghost karts and try to beat them!
cy: Rasio'n erbyn cartiau ysbrydion a cheisio eu curo!

source: Complete as many laps as possible in a given amount of time.
cy: Cwblhau gymaint o lapiau â phosibl mewn cyfnod penodol o amser.

source: Press red or blue soccer icon to change team
cy: Pwysa eicon pêl-droed coch neu las i newid tîm

source: Track by %s
cy: Trac gan %s

source: Max players supported: %d
cy: Cefnogi uchafswm o chwaraewyr: %d

source: Number of red team AI karts
cy: Nifer y cartiau AI tîm coch

source: You cannot play this Grand Prix because it contains tracks that aren't unlocked!
cy: Nid oes modd i ti chwarae'r Grand Prix hwn oherwydd ei fod yn cynnwys traciau sydd heb eu datgloi!

source: Locked!
cy: Wedi Cloi!

source: Complete all challenges to unlock the big door!
cy: Cwblha bob her i ddatgloi'r drws mawr!

source: You need more points to enter this challenge! Check the minimap for available challenges.
cy: Ti angen mwy o bwyntiau i gymryd rhan yn yr her! Edrycha ar y map bach am heriau sydd ar gael.

source: Accelerate with <%s>, and steer with <%s> and <%s>.
cy: Cyflyma gyda <%s>, a llywio gyda <%s> a <%s>.

source: Accelerate by touching the upper part of the wheel, and steer by moving left or right.
cy: Cyflyma trwy gyffwrdd â rhan uchaf yr olwyn, a llywio trwy symud i'r chwith neu'r dde.

source: Accelerate by moving the accelerator upwards, and steer by tilting your device.
cy: Cyflyma trwy symud y cyflymydd i fyny, a llywio trwy droi dy dyfais.

source: Accelerate by moving the accelerator upwards, and steer by rotating your device.
cy: Cyflyma trwy symud y cyflymydd i fyny, a llywio trwy droi dy ddyfais.

source: Collect gift boxes, and fire the weapon with <%s> to blow away these boxes!
cy: Casgla focsys anrhegion, a thanio'r arf gyda <%s> i chwythu'r blychau hyn i ffwrdd!

source: Collect gift boxes, and fire by pressing the bowling icon to blow away these boxes!
cy: Casgla flychau anrhegion, a thanio trwy bwyso'r eicon bowlio i chwythu'r blychau hyn i ffwrdd!

source: Press <%s> to look behind. Fire the weapon with <%s> while pressing <%s> to fire behind!
cy: Pwysa <%s> i edrych y tu ôl. Tania'r arf gyda <%s> wrth bwyso <%s> i danio nôl!

source: Press the mirror icon to look behind. Fire the weapon behind by holding the mirror icon and then swiping to the bowling icon!
cy: Pwysa'r eicon drych i edrych y tu ôl. Tania'r arf y tu ôl trwy ddal yr eicon drych ac yna troi at yr eicon bowlio!

source: Use the nitro you collected by pressing <%s>!
cy: Defnyddia'r nitro ti wedi ei gasglu trwy bwyso <%s>!

source: Use the nitro you collected by pressing the nitro icon
cy: Defnyddia'r nitro ti wedi ei gasglu trwy wasgu'r eicon nitro

source: Collect nitro bottles (we will use them after the curve).
cy: Casgla boteli nitro (byddwn yn eu defnyddio ar ôl y tro).

source: Oops! When you're in trouble, press <%s> to be rescued.
cy: Wps! Pan fyddi mewn trafferth, pwysa <%s> i gael dy achub.

source: Oops! When you're in trouble, press the bird icon to be rescued.
cy: Wps! Pan fyddi mewn trafferth, pwysa'r eicon adar i gael dy achub.

source: Accelerate and press the <%s> key while turning to skid. Skidding for a short while can help you turn faster to take sharp turns.
cy: Cyflyma a phwysa'r fysell <%s> wrth droi i sgid. Gall sgidio am gyfnod byr dy helpu i droi'n gynt i gymryd tro'n sydyn.

source: Accelerate and press the skid icon while turning to skid. Skidding for a short while can help you turn faster to take sharp turns.
cy: Cyflyma a phwysa'r fysell sgid wrth droi i sgid. Gall sgidio am gyfnod byr dy helpu i droi'n gynt i gymryd tro'n sydyn.

source: Note that if you manage to skid for several seconds, you will receive a bonus speedup as a reward!
cy: Sylwa, os byddi'n llwyddo i sgidio am sawl eiliad, byddi'n derbyn bonws cyflymu sydyn fel gwobr!

source: You are now ready to race. Good luck!
cy: Rwyt ti nawr yn barod i rasio. Pob lwc!

source: A 3D open-source kart racing game
cy: Gêm rasio cart cod agored 3D

source: tux;game;race;
cy: tux;gêm;rasio;

source: Karts. Nitro. Action! SuperTuxKart is a 3D open-source arcade racer with a variety of characters, tracks, and modes to play. Our aim is to create a game that is more fun than realistic, and provide an enjoyable experience for all ages.
cy: Cartiau. Nitro. Antur! Mae SuperTuxKart yn gêm rasio arcêd cod agored 3D gydag amrywiaeth o gymeriadau, traciau a moddau i'w chwarae. Ein nod yw creu gêm sy'n fwy o hwyl na realistig, ac yn cynnig profiad pleserus i bob oed.

source: We have several tracks with various themes for players to enjoy, from driving underwater, rural farmlands, jungles or even in space! Try your best while avoiding other karts as they may overtake you, but don't eat the bananas! Watch for bowling balls, plungers, bubble gum, and cakes thrown by your opponents.
cy: Mae gennym ni sawl trac gyda themâu amrywiol i chwaraewyr eu mwynhau, o yrru o dan y dŵr, tiroedd ffermydd gwledig, jyngl neu yn y gofod! Gwna dy orau wrth osgoi cartiau eraill oherwydd efallai y byddan nhw'n dy basio, ond paid â bwyta'r bananas! Gwylia am beli bowlio, plymwyr, gwm swigen, a chacennau wedi'u taflu gan dy wrthwynebwyr.

source: You can do a single race against other karts, compete in one of several Grand Prix, try to beat the high score in time trials on your own, play battle mode against the computer or your friends, and more! For a greater challenge, join online and meet players from all over the world and prove your racing skills!
cy: Gelli wneud ras unigol yn erbyn cartiau eraill, cystadlu mewn un o nifer o Grand Prix, ceisio curo'r sgôr uchel mewn treialon amser ar dy ben dy hun, chwarae modd brwydr yn erbyn y cyfrifiadur neu dy ffrindiau, a mwy! Am her fwy, ymuna ar-lein a chwrdd â chwaraewyr o bob cwr o'r byd a phrofi dy sgiliau rasio!

source: This game has no ads.
cy: Nid oes gan y gêm hon unrhyw hysbysebion.

source: This is an unstable version of SuperTuxKart that contains latest improvements. It is released mainly for testing, to make stable STK as good as possible.
cy: Mae hwn yn fersiwn ansefydlog o SuperTuxKart sy'n cynnwys y gwelliannau diweddaraf. Mae'n cael ei ryddhau'n bennaf ar gyfer profi, i wneud y STK sefydlog gorau posibl.

source: This version can be installed in parallel with the stable version on the device.
cy: Mae modd gosod y fersiwn hon ochr yn ochr â'r fersiwn sefydlog ar y ddyfais.

source: If you need more stability, consider using the stable version: %s
cy: Os oes angen mwy o sefydlogrwydd arnat, ystyria ddefnyddio'r fersiwn sefydlog: %s

source: SuperTuxKart Team
cy: Tîm SuperTuxKart
