Repository: ornfelt/stk-code
Catalog: data/po/*.po
Languages: cy

source: Extracting game data...
cy: Yn echdynnu data gêm...

source: Game data extraction error
cy: Gwall echdynnu data gêm

source: Check remaining device space or reinstall SuperTuxKart.
cy: Gwiria ofod y dyfais sy'n weddill neu ailosod SuperTuxKart.

source: Quit
cy: Gadael

source: Play every official track at least once.
cy: Chwarae pob trac swyddogol o leiaf unwaith.

source: Strike!
cy: Ergyd!

source: Hit 10 karts with a bowling-ball.
cy: Taro 10 cart gyda phêl fowlio.

source: Arch Enemy
cy: Archelyn

source: Hit the same kart at least 5 times in one race.
cy: Taro'r un cart o leiaf 5 gwaith mewn un ras.

source: Marathoner
cy: Marathonwr

source: Finish a race with at least twice the track's default lap number.
cy: Gorffen ras gydag o leiaf ddwywaith rhif lap rhagosodedig y trac.

source: Skid-row
cy: Rhes sgidio

source: Skid 5 times in a single lap.
cy: Sgidio 5 gwaith mewn un lap.

source: Gold driver
cy: Gyrrwr aur

source: Win against at least 3 AIs in normal race, time-trial, and follow the leader.
cy: Ennill yn erbyn o leiaf 3 AI mewn ras arferol, treial amser, a dilyn yr arweinydd.

source: Powerup Love
cy: Caru Pweru

source: Use 10 or more powerups in a race.
cy: Defnyddia 10 pweru neu fwy mewn ras.

source: Unstoppable
cy: Anataladwy

source: Win 5 single races in a row against at least 3 AIs. Beware, restarting a race counts as a loss.
cy: Enilla 5 ras unigol yn olynol yn erbyn o leiaf 3 AI. Bydd yn ofalus, mae ailgychwyn ras yn cyfrif fel colled.

source: Banana Lover
cy: Carwr Bananas

source: Collect at least 5 bananas in one race.
cy: Casgla o leiaf 5 banana mewn un ras.

source: It's secret
cy: Mae'n gyfrinach

source: Really ... a secret.
cy: Wir yn... gyfrinach.

source: Mosquito Hunter
cy: Heliwr Mosgito

source: Take your opponents for mosquitos! With the swatter, squash them at least 5 times in a race.
cy: Cymra dy wrthwynebwyr fel mosgitos! Gyda'r swatiwr, gwasga nhw o leiaf 5 gwaith mewn ras.

source: Beyond Luck
cy: Tu Hwnt i Lwc

source: Win 10 single races in a row in Expert or SuperTux against at least 5 AIs. Beware, restarting a race counts as a loss.
cy: Enilla 10 ras unigol yn olynol yn Arbenigwr neu SuperTux yn erbyn o leiaf 5 AI. Bydd yn ofalus, mae ailgychwyn ras yn cyfrif fel colled.

source: Penguin Playground
cy: Maes Chwarae Pengwiniaid

source: Off the Beaten Track
cy: Oddi ar y Llwybr Caled

source: To the Moon and Back
cy: I'r Lleuad ac yn Ôl

source: At World's End
cy: Ar Ddiwedd y Byd

source: Back
cy: Nôl

source: Install
cy: Gosod

source: Uninstall
cy: Dadosod

source: Select a type of control that you prefer
cy: Dewisa'r fath o reolaeth rwyt ti eisiau

source: Accelerometer
cy: Cyflymydd

source: Gyroscope
cy: Gyrosgop

source: Steering wheel
cy: Olwyn llywio

source: Auto acceleration
cy: Cyflymu awto/ceir

source: You can change it later in touch device settings.
cy: Gelli ei newid yn ddiweddarach yng ngosodiadau dy dyfais cyffwrdd.

source: Apply
cy: Gosod

source: Touch Device Settings
cy: Gosodiadau Dyfais Cyffwrdd

source: General
cy: Cyffredinol

source: Device enabled
cy: Dyfais wedi'i galluogi

source: Inverted buttons
cy: Botymau wedi'u gwrthdroi

source: Buttons scale
cy: Graddio botymau

source: Advanced
cy: Uwch

source: Deadzone
cy: Parth marw

source: Sensitivity X
cy: Sensitifrwydd X

source: Sensitivity Y
cy: Sensitifrwydd Y

source: Restore defaults
cy: Adfer y rhagosodiadau

source: Cancel
cy: Na

source: Yes
cy: Iawn

source: Revert
cy: Dychwelyd

source: Accept
cy: Derbyn

source: Camera Settings
cy: Gosodiadau Camera

source: Player camera
cy: Camera chwaraewr

source: Distance
cy: Pellter

source: Angle
cy: Ongl

source: Smooth camera
cy: Camera llyfn

source: Backward camera
cy: Camera'r cefn

source: Follow ball in soccer mode
cy: Dilyn y bêl yn y modd pêl-droed

source: Reset
cy: Ailosod

source: Graphics Settings
cy: Gosodiadau Graffeg

source: Advanced pipeline (lights, etc.)
cy: Piblinell uwch (goleuadau, ac ati)

source: Shadows
cy: Cysgodion

source: Bloom
cy: Blŵm

source: Light shaft (God rays)
cy: Siafft golau (pelydrau Duw)

source: Ambient occlusion
cy: Achludiad amgylchynol

source: Depth of field
cy: Dyfnder ffocws

source: Glow (Outlines)
cy: Tywynnu (Amlinelliadau)

source: Anti-aliasing
cy: Gwrth-lyfnhau

source: Motion blur
cy: Pylu symud

source: Image-based lighting
cy: Goleuo ar sail delwedd

source: Light Scattering
cy: Gwasgaru Golau

source: Animated characters
cy: Nodau animeiddiedig

source: Texture compression
cy: Cywasgu gwead

source: Particle effects
cy: Effeithiau gronynnau

source: Rendered image quality
cy: Ansawdd delwedd wedi'i rendro

source: Geometry detail
cy: Manylion geometreg

source: * Restart STK to apply new settings
cy: * Ailgychwyn STK i osod y gosodiadau newydd

source: Close
cy: Cau

source: Join
cy: Ymuno

source: OK
cy: Iawn

source: Record the race for ghost replay
cy: Recordio'r ras ar gyfer ailchwarae ysbrydion

source: Watch replay only
cy: Dim ond gwylio'r ailchwarae

source: Compare to another ghost
cy: Cymharu ag ysbryd arall

source: Remove
cy: Tynnu

source: Compare ghost
cy: Cymharu'r ysbryd

source: Start Race
cy: Cychwyn Ras

source: Goal
cy: Nod

source: Progress
cy: Cynnydd

source: Password Change
cy: Newid Cyfrinair

source: Current Password
cy: Cyfrinair Cyfredol

source: New Password
cy: Cyfrinair Newydd

source: Confirm
cy: Cadarnhau

source: Submit
cy: Cyflwyno

source: Back to Race
cy: Nôl i'r Ras

source: Quit Server
cy: Gadael y Gweinydd

source: Back to lobby
cy: Yn ôl i'r cyntedd

source: Restart Race
cy: Ail Gychwyn Ras

source: Give Up Race
cy: Rhoi'r Gorau Iddi

source: Options
cy: Dewisiadau

source: Help
cy: Cymorth

source: Top 10 players
cy: Y 10 Chwaraewr Gorau

source: Refresh
cy: Adnewyddu

source: Account Recovery
cy: Adfer Cyfrif

source: You will receive an email with further instructions on how to reset your password. Please be patient and be sure to check your spam folder.
cy: Byddi'n derbyn e-bost gyda chyfarwyddiadau pellach ar sut i ailosod dy gyfrinair. Bydd yn amyneddgar a gwna'n siŵr dy fod yn gwirio dy ffolder sbam.

source: Fill in the username and email address you supplied at registration to be able to reset your password.
cy: Rho'r enw defnyddiwr a'r cyfeiriad e-bost nes ti eu defnyddio wrth gofrestru er mwyn gallu ailosod dy gyfrinair.

source: Username
cy: Enw Defnyddiwr

source: Email
cy: E-bost

source: Terms and Agreement
cy: Telerau a Chytundeb

source: I agree to the above terms and am 13 years or older.
cy: Rwy'n cytuno â'r telerau uchod ac rwy'n 13 oed neu'n hŷn.

source: Server Configuration
cy: Ffurfweddiad Gweinydd

source: Difficulty
cy: Anhawster

source: Novice
cy: Dechreuwr

source: Intermediate
cy: Canolradd

source: Expert
cy: Arbenigwr

source: Game mode
cy: Modd gêm

source: Normal Race
cy: Ras Arferol

source: Time Trial
cy: Treialon Amser

source: Battle
cy: Brwydr

source: Soccer
cy: Pêl-droed

source: Password
cy: Cyfrinair

source: Bookmark this server
cy: Nod tudalen i'r gweinydd hwn

source: Add player
cy: Ychwanegu chwaraewr

source: Name
cy: Enw

source: Handicap
cy: Anfantais

source: Press the 'All players ready' button after the player list is ready.
cy: Pwysa'r botwm 'Pob chwaraewr yn barod' pan fydd y rhestr chwaraewyr yn barod.

source: Clear players
cy: Clirio'r chwaraewyr

source: All players ready
cy: Pob chwaraewr yn barod

source: User Info
cy: Gwybodaeth Ddefnyddwyr

source: Remove Friend
cy: Tynnu Ffrind

source: Add Friend
cy: Ychwanegu Ffrind

source: Accept Invite
cy: Derbyn Gwahoddiad

source: Decline Invite
cy: Gwrthod Gwahoddiad

source: View Profile
cy: Gweld Proffil

source: Vote
cy: Pleidleisio

source: Paused
cy: Oedwyd

source: Back to Game
cy: Nôl i'r Gêm

source: Back to menu
cy: Nôl i'r ddewislen

source: Select kart
cy: Dewis cart

source: Press fully and release...
cy: Pwysa'n llawn a rhyddhau...

source: Assign to ESC key
cy: Aseinio i allwedd ESC

source: Assign nothing
cy: Aseinio dim byd

source: Recommend Video Settings
cy: Gosodiadau Fideo gorau

source: The recommended settings will be valid for the current resolution.
cy: Bydd y gosodiadau gorau'n ddilys ar gyfer y cyferbyniad cyfredol.

source: What should the settings prioritize?
cy: Beth ddylai'r gosodiadau flaenoriaethu?

source: Performance
cy: Perfformiad

source: Balance performance and graphics quality
cy: Cydbwyso perfformiad ac ansawdd graffeg

source: Graphics quality
cy: Ansawdd graffeg

source: Sparing energy
cy: Arbed ynni

source: Do you like graphics effects creating blur?
cy: Ydych chi'n hoffi effeithiau graffeg yn creu pŵl?

source: Start the test
cy: Dechreuwch y prawf

source: Race Setup
cy: Gosodiad Ras

source: Continue
cy: Parhau

source: SuperTuxKart Addons
cy: Ychwanegion SuperTuxKart

source: Updated
cy: Diweddarwyd

source: Rating >=
cy: Graddio >=

source: Karts
cy: Cartiau

source: Tracks
cy: Traciau

source: Arenas
cy: Arenau

source: Installed
cy: Wedi'i osod

source: Edit favorite arenas
cy: Golygu hoff arenâu

source: Standard
cy: Safonol

source: Add-Ons
cy: Ychwanegion

source: All
cy: Y Cyfan

source: Credits
cy: Diolchiadau

source: Skip
cy: Hepgor

source: All Tracks
cy: Pob Trac

source: Edit Grand Prix
cy: Golygu Grand Prix

source: Move up
cy: Symud i fyny

source: Move down
cy: Symud i lawr

source: Add
cy: Ychwanegu

source: Edit
cy: Golygu

source: Save
cy: Cadw

source: Number of laps:
cy: Nifer o lapiau:

source: Reverse:
cy: Am yn Ôl:

source: Ghost Replay Selection
cy: Dewis Ailchwarae Ysbrydion

source: Egg Hunt
cy: Helfa Wyau

source: Only show the best times
cy: Dim ond dangos yr amseroedd gorau

source: Compare replay
cy: Cymharu'r ailchwarae

source: Only show replays matching the current difficulty
cy: Dim ond yn dangos ailchwarae sy'n cyfateb i'r anhawster presennol

source: Only show replays matching the current version
cy: Dim ond dangos ailchwaraeon sy'n cyfateb i'r fersiwn gyfredol

source: Hide multiplayer replays
cy: Cuddio ailchwarae aml-chwaraewr

source: Record a ghost replay
cy: Recordio ailchwarae ysbryd

source: AI karts
cy: Cartiau AI

source: Reverse
cy: Am yn Ôl

source: Maximum time (min.)
cy: Uchafswm amser (mun.)

source: Track group
cy: Grŵp trac

source: Continue saved GP
cy: Parhau gyda'r GP wedi'i gadw

source: Grand Prix editor
cy: Golygydd Grand Prix

source: New
cy: Newydd

source: Copy
cy: Copïo

source: Rename
cy: Ailenwi

source: Save Grand Prix
cy: Cadw Grand Prix

source: SuperTuxKart Help
cy: Cymorth SuperTuxKart

source: Game Modes
cy: Moddau Gêm

source: Powerups
cy: Pweriadau

source: Story Mode
cy: Modd Stori

source: Kart classes
cy: Dosbarthiadau cartiau

source: Multiplayer
cy: Aml-chwaraewr

source: Start the tutorial
cy: 'r tiwtorial

source: Collect blue gift boxes, they will give you powerups.
cy: Casgla flychau anrhegion glas, byddan nhw'n rhoi pweriadau i ti.

source: Avoid bananas!
cy: Osgoa fananas!

source: Collecting nitro allows you to get speed boosts whenever you wish by pressing the appropriate key or button. You can see your current level of nitro in the gauge at the bottom-right of the race screen.
cy: Mae casglu nitro yn caniatáu i ti gael hwb cyflymder pryd bynnag y byddi eisiau trwy bwyso'r fysell neu'r botwm priodol. Gelli weld dy lefel bresennol o nitro yn y mesurydd ar waelod ochr dde'r sgrin rasio.

source: If you see a button with a lock like this one, you need to complete a challenge to unlock it.
cy: Os gweli di fotwm gyda chlo fel hwn, mae'n rhaid i ti gwblhau her i'w ddatgloi.

source: You can skid by pressing a special key or button. Successive short skids help to take sharp turns; while medium skids will boost your speed, long skids more so. You can't stop turning while skidding, so orient your kart carefully before!
cy: Mae modd i ti sgidio trwy bwyso bysell neu fotwm arbennig. Mae sgidiau byr olynol yn helpu i gymryd tro sydyn; tra bydd sgidiau canolig yn rhoi hwb i dy gyflymder, sgidiau hir yn fwy felly. Does dim modd stopio troi wrth sgidio, felly cyfeiria dy gart yn ofalus o'r cychwyn!

source: You can get a startup boost by pressing the accelerate button at 'Set!', before the race's start.
cy: Mae modd gael hwb cychwynnol trwy bwyso'r botwm cyflymu yn 'Set!', cyn i'r ras gychwyn.

source: * Current key bindings can be seen/changed in the Options menu
cy: * Mae modd gweld/newid y dynodiad bysell cyfredol yn y ddewislen Dewisiadau

source: SuperTuxKart features several game modes:
cy: Mae SuperTuxKart yn cynnwys sawl modd gemau:

source: Regular Race: All blows allowed, so collect powerups and use them smartly!
cy: Ras Arferol: Yn caniatáu pob ergyd, felly casgla pweriadau a'u defnyddio'n slic!

source: Time Trial: Contains no powerups, so only your driving skills matter!
cy: Treialon Amser: Nid yw'n cynnwys unrhyw bweriadau, felly dim ond eich sgiliau gyrru sy'n bwysig!

source: Follow the leader: Run for second place, as the last kart will be disqualified every time the counter hits zero. Beware: going in front of the leader will get you eliminated too!
cy: Dilyn yr arweinydd: Rheda am yr ail safle, gan y bydd y cart olaf yn cael ei ddiarddel bob tro y bydd y cownter yn taro sero. Bydd yn ofalus: bydd mynd o flaen yr arweinydd yn dy ddileu hefyd!

source: There are 3 types of battle mode: In 3 Strikes Battle, you need to hit others with weapons until they lose all their lives. In Free-For-All, the player who hits others the most will win in a given hit or time limit. In Capture The Flag, your team needs to bring the flag of the other team to your own flag base, as long as your flag is not captured by the other team.
cy: Mae yna 3 math o fodd brwydr: Yn y Frwydr 3 Hergwd, mae angen i ti daro eraill gydag arfau nes iddyn nhw golli eu holl fywydau. Yn y Rhydd i Bawb, y chwaraewr sy'n taro pawb arall fwyaf fydd yn ennill cyfnod neu ergyd benodol. Yn Cipio'r Faner, mae angen i dy dîm ddod â baner y tîm arall i gartref dy faner, cyn belled nad yw dy faner yn cael ei chipio gan y tîm arall.

source: Soccer: Use your kart to push the ball into the goal.
cy: Pêl-droed: Defnyddia dy gart i wthio'r bêl i mewn i'r gôl.

source: Egg hunt: Explore tracks to find all hidden eggs.
cy: Helfa wyau: Chwilia'r traciau i ddod o hyd i'r holl wyau cudd.

source: Ghost replay: Race against ghost replays in time-trial or egg hunt mode, and record your own!
cy: Ailchwarae ysbrydion: Rasio yn erbyn ailchwarae ysbrydion yn y modd treialon amser neu helfa wyau, a chofnodi dy un di!

source: Lap Trial: Complete as many laps as possible in a given amount of time.
cy: Treialon Lapiau: Cwblha gymaint o lapiau â phosibl mewn cyfnod penodol o amser.

source: * Many of these game modes can also be played in a Grand Prix fashion: instead of playing a single race, you play many in a row. The better you rank, the more points you get. In the end, the player with the most points wins the cup.
cy: * Mae modd chwarae llawer o'r moddau gêm hyn hefyd fel mewn Grand Prix: yn lle chwarae un ras, rwyt ti'n chwarae llawer un ar ôl y llall. Y gorau rwyt ti'n gwneud, y mwyaf o bwyntiau ti'n cael. Yn y diwedd, y chwaraewr gyda'r mwyaf o bwyntiau sy'n ennill y cwpan.

source: To help you win, there are some powerups you can collect:
cy: I dy helpu i ennill, mae rhai pweriadau y mae modd i ti eu casglu:

source: BubbleGum - protect yourself with a shield, or use while looking back to leave a sticky pink puddle behind you.
cy: GwmSwigod - diogela dy hun gyda tharian, neu ei defnyddio, wrth edrych yn ôl, i adael pwll pinc gludiog ar dy ôl.

source: Zipper - will give you a strong speed boost. But beware of not losing control of your kart!
cy: Sipiwr - bydd yn rhoi hwb cyflymder cryf i ti. Ond bydd yn ofalus rhag colli rheolaeth ar dy gart!

source: Cake - thrown at the closest rival, best on short ranges and long straights. It also affects other karts close to the explosion.
cy: Cacen - wedi'i daflu at dy gystadleuydd agosaf, yn orau os yn agos ac ar drac hir a syth. Mae hefyd yn effeithio ar gartiau eraill sy'n agos at y ffrwydrad.

source: Plunger - throw straight to pull an opponent back, or throw while looking back to make one lose sight.
cy: Plymiwr - tafla'n syth i dynnu dy wrthwynebydd yn ôl, neu ei daflu wrth edrych yn ôl i wneud i un golli golwg.

source: Bowling Ball - goes straight until it strikes, it can bounce off walls. If you are looking back, it will be thrown backwards.
cy: Pêl Fowlio - yn mynd yn syth nes ei fod yn taro, yna gall fownsio oddi ar y waliau. Os wyt ti'n edrych nôl, bydd yn cael ei daflu am yn ôl.

source: Parachute - slows down all karts in a better position.
cy: Parasiwt - yn arafu pob cart sydd mewn sefyllfa well.

source: Swapper - gift boxes are transformed into bananas, nitro cans into bubblegums, and vice versa for a short time.
cy: Swapiwr - mae blychau rhoddion yn cael eu trawsnewid yn fananas, caniau nitro yn gwm swigod, ac yn ôl am gyfnod byr.

source: Basket Ball - bounces after the leader, and might squash and slow down karts down on the way.
cy: Pêl Fasged - yn bownsio ar ôl yr arweinydd, ac efallai yn gwasgu ac arafu cartiau ar y ffordd.

source: Swatter - will squash karts close by, slowing them down. Can also be used to remove parachutes and bombs.
cy: Swatiwr - bydd yn cywasgu cartiau sydd gerllaw, gan eu harafu. Mae modd ei ddefnyddio hefyd i gael gwared ar barasiwtiau a bomiau.

source: Hitting a banana can result in one of the following being attached to the kart:
cy: Gall taro banana olygu bod un o'r canlynol yn cydio i'r cart:

source: Anchor - slows down the kart suddenly.
cy: Angor - yn arafu'r cart yn sydyn.

source: Parachute - slows down the kart, more progressively than the anchor. The faster you go, the stronger it slows you down.
cy: Parasiwt - yn arafu'r cart, yn fwy cynyddol na'r angor. Po gyflymaf yr ei di, y cryfaf y bydd yn dy arafu.

source: Bomb - detonates after some amount of time, throwing the kart up in the air. Bump into another kart to transfer the bomb to it.
cy: Bom - bydd yn tanio ar ôl peth amser, gan daflu'r cart i fyny yn yr awyr. Trosglwydda i gert arall drwy daro yn ei erbyn.

source: The evil Nolok has captured Gnu! Here are a few tips to help you:
cy: Mae'r Nolok drwg wedi cipio Gnu! Dyma rhai awgrymiadau i dy helpu:

source: This icon on the minimap shows the available challenges you've not completed. In the top-right of the screen, it also tells you how many points you currently have. Complete as many challenges as possible, and Nolok will accept to race against you. Win to liberate Gnu!
cy: Mae'r eicon hwn ar y map bychan yn dangos yr heriau sydd ar gael nad wyt ti wedi'u cwblhau. Ar ochr dde uchaf y sgrin, mae hefyd yn dweud wrthyt faint o bwyntiau sydd gennyt ar hyn o bryd. Ceisia gwblhau gynifer o heriau â phosibl, a bydd Nolok yn derbyn yr her o rasio yn dy erbyn. Rhaid ennill i ryddhau Gnu!

source: When you complete a challenge, you get a cup. Each cup is worth several points. The higher the difficulty you completed the challenge in, the better the cup and the more points it is worth.
cy: Pan fyddi wedi cwblhau her, rwyt ti'n cael cwpan. Mae pob cwpan yn werth sawl pwynt. Po fwyaf yr anhawster yr her, y gorau yw'r cwpan a'r mwyaf o bwyntiau y mae'n werth.

source: When you get the number of points indicated below this icon, you'll be gifted a surprise. There are several to collect.
cy: Pan gei di'r nifer o bwyntiau sy'n cael eu dangos o dan yr eicon hwn, byddi'n cael syrpreis. Mae yna sawl un i'w casglu.

source: Not all karts drive the same! They belong to classes with several differences:
cy: Nid yw pob cart yn gyrru'r un peth! Maen nhw'n perthyn i ddosbarthiadau gyda nifer o wahaniaethau:

source: Mass - there are three classes of karts, depending on their mass: light, medium and heavy. Heavier karts are less affected by parachutes and are more resistant to explosions.
cy: Màs - mae tri dosbarth o gartiau, yn dibynnu ar eu màs: ysgafn, canolig a thrwm. Mae cartiau trymach yn cael eu heffeithio llai gan barasiwtiau ac maen nhw'n gallu gwrthsefyll ffrwydradau yn well.

source: Acceleration - especially useful at start, after an accident, or in tracks with a lot of sharp curves. The lighter the kart, the faster it accelerates, especially at low speeds.
cy: Cyflymiad - yn arbennig o ddefnyddiol ar y cychwyn, ar ôl damwain, neu mewn traciau gyda llawer o droadau tynn. Po ysgafnaf yw'r cart, y cyflymaf y mae'n cyflymu, yn enwedig ar gyflymder isel.

source: Max speed - the higher it is, the faster the kart can go. Especially useful in tracks with straight lines and gentle curves. Heavier karts have a higher top speed.
cy: Cyflymder uchaf - po uchaf ydyw, y cyflymaf y gall y cart fynd. Yn arbennig o ddefnyddiol mewn traciau gyda llinellau syth a throadau mawr. Mae gan gartiau trymach gyflymder uchaf uwch.

source: Nitro efficiency - The higher it is, the more speed you get from a can of nitro. A lighter kart will have higher nitro efficiency.
cy: Effeithlonrwydd nitro - po uchaf yw hi, y mwyaf o gyflymder gewch o gan o nitro. Bydd gan gart ysgafnach effeithlonrwydd nitro uwch.

source: If you follow closely another kart for a few seconds, you'll get a slipstream speed bonus when you overtake it. The lighter your kart, the easier it is.
cy: Os dilynwch gert arall yn agos am ychydig eiliadau, fe gewch chi fonws cyflymder sgilwynt pan fyddwch chi'n ei basio. Po ysgafnaf yw eich cart, yr hawsaf yw i wneud hynny.

source: SuperTuxKart can be played in multiplayer mode online...:
cy: Mae'n bosibl chwarae SuperTuxKart yn y modd aml-chwaraewr ar-lein...:

source: First, select the 'online' icon in the main menu. Choose either local networking, or global networking (requires internet to be enabled in the options). Then, you can either create your own server with custom options, or search among a list of existing servers to join. Some of them are recommended servers with optionally ranked races.
cy: Yn gyntaf, dewisa'r eicon 'ar-lein' yn y brif ddewislen. Dewisa naill ai rhwydweithio lleol, neu rwydweithio byd-eang (mae angen galluogi rhyngrwyd yn y Dewisiadau). Yna, gelli naill ai greu dy weinydd dy hun gyda dewisiadau arferol, neu chwilio ymhlith rhestr o weinyddion cyfredol i ymuno â nhw. Mae rhai ohonyn nhw'n weinyddion sy'n cael eu hargymell, gyda rasys o ddewis wedi'u rhestru.

source: Once in a server, a race will begin once its owner (symbolized with the crown) decides so. Official servers may auto-start races only when there are enough players. Then, you can choose your kart and vote for the next track to race on. An addon track is allowed only if it exists on all joined players and the server.
cy: Unwaith o fewn gweinydd, bydd ras yn cychwyn unwaith y bydd ei berchennog (wedi'i symboleiddio â'r goron) yn penderfynu gwneud hynny. Dim ond pan fydd digon o chwaraewyr ar gael y gall gweinyddwyr swyddogol gychwyn rasys yn awtomatig. Yna, gelli ddewis dy gart a phleidleisio dros y trac nesaf i rasio arno. Mae trac ychwanegol yn cael ei ganiatáu dim ond os yw'n bodoli ar yr holl chwaraewyr sydd wedi ymuno a'r gweinydd.

source: ... or on the same device:
cy: ... neu ar yr un ddyfais:

source: First, you will need several input devices. Use the input configuration screen to set them up. Multiple gamepads or joysticks are ideal: on keyboard(s), each player will need a different set of keys, and most keyboards are not appropriate for multiplayer because they don't support multiple simultaneous keypresses.
cy: Yn gyntaf, bydd angen sawl dyfais mewnbwn arnat ti. Defnyddia'r sgrin ffurfweddu mewnbwn i'w gosod. Padiau gêm neu ffyn reoli yr un sydd orau. Ar fysellfyrddau, bydd angen set gwahanol o allweddi ar bob chwaraewr, ac nid yw'r rhan fwyaf o fysellfyrddau yn briodol ar gyfer aml-chwaraewr oherwydd nad ydyn nhw'n cynnal gwasgu bysellfyrddau lluosog ar yr un pryd.
